{
  "id": "https://thecryptobasic.com/?p=128483",
  "title": "Amazon and Walmart Exploring Launch of Their Own Stablecoins: Report",
  "link": "https://thecryptobasic.com/2025/06/13/amazon-and-walmart-exploring-launch-of-their-own-stablecoins-report/?utm_source=rss&utm_medium=rss&utm_campaign=amazon-and-walmart-exploring-launch-of-their-own-stablecoins-report",
  "summary": "<strong>Two major retail giants, Walmart and Amazon, are reportedly exploring the launch of their dollar-pegged stablecoins. </strong>\n\nThe Wall Street Journal (WSJ) <a href=\"https://www.wsj.com/finance/banking/walmart-amazon-stablecoin-07de2fdd?siteid=yhoof2\" rel=\"nofollow noopener\" target=\"_blank\">reported</a> the development today, citing sources with direct knowledge of the matter. According to WSJ, the retail behemoths are considering launching brand-specific stablecoins pegged to the U.S. ",
  "published": "Fri, 13 Jun 2025 15:31:12 +0000",
  "content": "<strong>Two major retail giants, Walmart and Amazon, are reportedly exploring the launch of their dollar-pegged stablecoins. </strong>\n\nThe Wall Street Journal (WSJ) <a href=\"https://www.wsj.com/finance/banking/walmart-amazon-stablecoin-07de2fdd?siteid=yhoof2\" rel=\"nofollow noopener\" target=\"_blank\">reported</a> the development today, citing sources with direct knowledge of the matter. According to WSJ, the retail behemoths are considering launching brand-specific stablecoins pegged to the U.S. dollar. \nPotential Benefits \nStablecoins could enhance companies' operations by offering instant and cheaper transactions. This would contrast with what is obtainable in the traditional financial system, where settlements sometimes take days, and users pay significant fees. \n\nMoreover, these dollar-pegged tokens could help companies save millions of dollars in transaction fees. However, the initiative could negatively impact the retail behemoths' banking partners. \n\nBy issuing brand-specific stablecoins, Amazon and Walmart could shift massive cash flows away from their banking partners. For context, Amazon's global e-commerce sales reached an astounding $447 billion in 2024, while Walmart's global sales surpassed $100 billion the previous year. \n\nSince stablecoins offer cheaper transactions, saving a small fee on each transaction could help the e-commerce giants save millions of dollars. \n\nIn the meantime, Amazon and Walmart have not confirmed whether they are planning to launch dollar-pegged stablecoins. \nGENIUS Act's Passage Will Determine Stablecoins' Launch \nNonetheless, the potential launch of the brand-specific stablecoins for Amazon and Walmart is contingent on the passage of the highly anticipated GENIUS Act. \n\nThe legislation represents the United States' effort to regulate the stablecoin market by establishing straightforward anti-money laundering (AML) and collateralization rules. Congress has been <a href=\"https://thecryptobasic.com/2025/05/20/16-democratic-senators-flip-vote-to-yes-as-stablecoin-genius-act-advances-in-us-senate/\" rel=\"noopener\" target=\"_blank\">deliberating</a> on its potential passage since Bill Hagerty introduced it earlier this year. \n\nThe bill has undergone several voting exercises, including one earlier this week when congressional members voted to invoke cloture on its recent amendment. \n\nAccording to Eleanor Terrett, the Senate has scheduled a final passage vote for the GENIUS Act on June 17, 2025. \n\nhttps://twitter.com/EleanorTerrett/status/1933295510439313721\n\nIf the bill passes, it could allow Amazon and Walmart to introduce their stablecoins under a regulatory framework. \n\nWhile Walmart and Amazon plan to introduce brand-specific stablecoins, rival Shopify is considering integrating with an existing one. Yesterday, Shopify rolled out early access for Circle's USDC payments. \n\nUnder the initiative, merchants can accept USDC payments from customers on the Base network. Notably, Shopify partnered with Stripe and San Francisco-based exchange Coinbase for the initiative.",
  "title_pt": "Amazon e Walmart exploram lançamento de suas próprias stablecoins: relatório",
  "summary_pt": "Duas grandes gigantes do varejo, Walmart e Amazon, estão supostamente explorando o lançamento de suas próprias stablecoins atreladas ao dólar.\n\nO Wall Street Journal (WSJ) <a href=\"https://www.wsj.com/finance/banking/walmart-amazon-stablecoin-07de2fdd?siteid=yhoof2\" rel=\"nofollow noopener\" target=\"_blank\">reportou</a> o desenvolvimento hoje, citando fontes com conhecimento direto do assunto. De acordo com o WSJ, as gigantes do varejo estão considerando o lançamento de stablecoins de marca própria atreladas ao dólar americano.",
  "content_pt": "Dois gigantes do varejo, Walmart e Amazon, estão supostamente explorando o lançamento de suas próprias stablecoins atreladas ao dólar.\n\nO Wall Street Journal (WSJ) <a href=\"https://www.wsj.com/finance/banking/walmart-amazon-stablecoin-07de2fdd?siteid=yhoof2\" rel=\"nofollow noopener\" target=\"_blank\">reportou</a> o desenvolvimento hoje, citando fontes com conhecimento direto do assunto. De acordo com o WSJ, as gigantes do varejo estão considerando o lançamento de stablecoins específicas da marca, atreladas ao dólar americano.\n\n**Benefícios Potenciais**\n\nStablecoins poderiam aprimorar as operações das empresas ao oferecer transações instantâneas e mais baratas. Isso contrastaria com o que é possível no sistema financeiro tradicional, onde os acertos às vezes levam dias e os usuários pagam taxas significativas.\n\nAlém disso, esses tokens atrelados ao dólar poderiam ajudar as empresas a economizar milhões de dólares em taxas de transação. No entanto, a iniciativa poderia impactar negativamente os parceiros bancários dos gigantes do varejo.\n\nAo emitir stablecoins específicas da marca, a Amazon e o Walmart poderiam desviar fluxos de caixa massivos de seus parceiros bancários. Para contextualizar, as vendas globais de e-commerce da Amazon chegaram a impressionantes US$ 447 bilhões em 2024, enquanto as vendas globais do Walmart superaram US$ 100 bilhões no ano anterior.\n\nComo as stablecoins oferecem transações mais baratas, economizar uma pequena taxa em cada transação poderia ajudar os gigantes do e-commerce a economizar milhões de dólares.\n\nEnquanto isso, a Amazon e o Walmart não confirmaram se pretendem lançar stablecoins atreladas ao dólar.\n\n**A Aprovação do GENIUS Act Determinará o Lançamento das Stablecoins**\n\nNo entanto, o lançamento potencial das stablecoins específicas da marca para a Amazon e o Walmart depende da aprovação do altamente aguardado GENIUS Act.\n\nA legislação representa o esforço dos Estados Unidos para regular o mercado de stablecoins estabelecendo regras claras de combate à lavagem de dinheiro (AML) e de garantia. O Congresso tem <a href=\"https://thecryptobasic.com/2025/05/20/16-democratic-senators-flip-vote-to-yes-as-stablecoin-genius-act-advances-in-us-senate/\" rel=\"noopener\" target=\"_blank\">debatido</a> sua possível aprovação desde que Bill Hagerty o apresentou no início deste ano.\n\nO projeto de lei passou por várias votações, incluindo uma no início desta semana, quando os membros do Congresso votaram para invocar a cláusula de encerramento de debates em sua emenda recente.\n\nDe acordo com Eleanor Terrett, o Senado agendou uma votação final para aprovação do GENIUS Act para 17 de junho de 2025.\n\nhttps://twitter.com/EleanorTerrett/status/1933295510439313721\n\nSe o projeto de lei for aprovado, ele poderá permitir que a Amazon e o Walmart introduzam suas stablecoins sob uma estrutura regulatória.\n\nEnquanto a Walmart e a Amazon planejam introduzir stablecoins específicas da marca, a rival Shopify está considerando a integração com uma stablecoin já existente. Ontem, a Shopify lançou o acesso antecipado aos pagamentos USDC da Circle.\n\nSob a iniciativa, os comerciantes podem aceitar pagamentos USDC de clientes na rede Base. É importante destacar que a Shopify se associou à Stripe e à corretora sediada em São Francisco, Coinbase, para esta iniciativa.",
  "filename": "post_1749844981_amazon-e-walmart-exploram-lancamento-de-suas-proprias-stablecoins-relatorio.json"
}