{
  "id": "https://thecryptobasic.com/?p=130604",
  "title": "Largest Hack in History? Coinbase Exec Reveals Why the 80,000 Bitcoin Transfer Was Likely a Hack",
  "link": "https://thecryptobasic.com/2025/07/05/largest-hack-in-history-coinbase-exec-reveals-why-the-80000-bitcoin-transfer-was-likely-a-hack/?utm_source=rss&utm_medium=rss&utm_campaign=largest-hack-in-history-coinbase-exec-reveals-why-the-80000-bitcoin-transfer-was-likely-a-hack",
  "summary": "<b>A Coinbase executive shed new light on the recent $8 billion Bitcoin transfer yesterday, a twist that might set a new heist record.</b>\n\nConor Grogan, Coinbase’s head of product, sparked fresh speculations about the July 4 Bitcoin transfer in a <a href=\"https://x.com/jconorgrogan/status/1941182442255405266\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, suggesting the transfer might be beyond a whale casually relocating his stash. Specifically, he noted that there is a small chance that t",
  "published": "Sat, 05 Jul 2025 07:45:54 +0000",
  "content": "<b>A Coinbase executive shed new light on the recent $8 billion Bitcoin transfer yesterday, a twist that might set a new heist record.</b>\n\nConor Grogan, Coinbase’s head of product, sparked fresh speculations about the July 4 Bitcoin transfer in a <a href=\"https://x.com/jconorgrogan/status/1941182442255405266\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, suggesting the transfer might be beyond a whale casually relocating his stash. Specifically, he noted that there is a small chance that the $8.6 billion worth of Bitcoin moved yesterday might have been compromised.\nSuspicious Test Raises Alarm\nFor context, several wallets containing 10,000 BTC <a href=\"https://thecryptobasic.com/2025/07/04/bitcoin-whale-shifts-40000-btc-worth-4-26b-after-over-14-years-of-dormancy/\" rel=\"noopener\" target=\"_blank\">awoke yesterday</a> after being dormant for over 14 years, with their sequence raising eyebrows. Notably, Lookonchain confirmed that it was a Bitcoin OG who was moving his stash.\n\nAbout 8 wallets were tied to the whale, each containing 10,000 BTC. Particularly, the whale moved all bitcoins to 8 new addresses, which still hold the stash at the time of writing.\n\nNonetheless, Grogan highlighted a few reasons why the move might not have come from the account’s original owner. For one, the Coinbase exec said he discovered a singular test transaction on the Bitcoin Cash network from one of the whales, followed by the full amount.\n\nThis meant that the transaction was to test the private keys quietly on the BCH network, which attracted less attention than on <a href=\"https://thecryptobasic.com/tag/bitcoin/\" rel=\"noopener\" target=\"_blank\">Bitcoin</a>. Further details reveal that the test transaction involved 10,000 BCH, worth approximately $4.9 million at the time.\n\n<figure class=\"wp-caption alignnone\" style=\"width: 2626px;\"><img alt=\"\" height=\"1544\" src=\"https://pbs.twimg.com/media/GvB1v2RWoAAggYK?format=jpg&amp;name=4096x4096\" width=\"2626\" /><figcaption class=\"wp-caption-text\">Receipt Of Test Transaction</figcaption></figure>\n\nAfter a successful test, the whale moved its first 10,000 BTC ($1.09 billion) from the “12tLs9” before shifting from all other 7 wallets linked to the owner, totaling 80,009 BTC ($8.6 billion).\nGrogan Highlights Strange Move\nMoreover, Grogan shared that the other BCH wallets affiliated with the BTC whale remain untouched, aside from the one involved in the test transaction. As a result, he questioned why the owner had not moved them if his intention was simply to relocate his Bitcoin stash to new addresses.\n\nGrogan ruled out the possibility it was an exchange wallet or an institution moving their stash due to the BCH test transaction. He also highlighted that the whale moved the stash manually, further suggesting it was an individual.\n\nNonetheless, he stressed that he was “speculating on straws here” and had not confirmed his suspicions. But if it is right, the BTC theft would be the largest heist in human history.\n\nRemarkably, it would trounce the <a href=\"https://thecryptobasic.com/2025/02/22/north-korean-hackers-drain-1-46b-in-ethereum-from-bybit-heres-how-they-might-cash-out/\" rel=\"noopener\" target=\"_blank\">Bybit hack</a>, which currently stands as the largest dollar-worth heist in crypto history. Recall that hackers drained $1.5 billion from Bybit in February and have <a href=\"https://thecryptobasic.com/2025/03/04/hackers-complete-movement-of-bybit-hack-loot-but-all-hope-is-not-lost/\" rel=\"noopener\" target=\"_blank\">completely moved</a> the looted funds.",
  "title_pt": "Maior ataque da história? Executivo da Coinbase revela por que transferência de 80.000 Bitcoins foi provavelmente um hack",
  "summary_pt": "Um executivo da Coinbase lançou nova luz sobre a recente transferência de US$ 8 bilhões em Bitcoin ocorrida ontem, uma reviravolta que pode estabelecer um novo recorde de roubo.\n\nConor Grogan, chefe de produto da Coinbase, gerou novas especulações sobre a transferência de Bitcoin de 4 de julho em um <a href=\"https://x.com/jconorgrogan/status/1941182442255405266\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, sugerindo que a transferência pode ir além de uma \"baleia\" (grande investidor) simplesmente realocando seus ativos. Especificamente, ele observou que existe uma pequena chance de que...",
  "content_pt": "Um executivo da Coinbase lançou nova luz sobre a recente transferência de US$ 8 bilhões em Bitcoin, ocorrida ontem, uma reviravolta que pode quebrar o recorde de roubo.\n\nConor Grogan, chefe de produto da Coinbase, gerou novas especulações sobre a transferência de Bitcoin de 4 de julho em um <a href=\"https://x.com/jconorgrogan/status/1941182442255405266\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, sugerindo que a transferência pode ser algo além de um \"whale\" simplesmente realocando seus ativos. Especificamente, ele observou que existe uma pequena chance de que os US$ 8,6 bilhões em Bitcoin movimentados ontem possam ter sido comprometidos.\n\nTeste Suspeito Dispara Alarme\n\nPara contextualizar, várias carteiras contendo 10.000 BTC <a href=\"https://thecryptobasic.com/2025/07/04/bitcoin-whale-shifts-40000-btc-worth-4-26b-after-over-14-years-of-dormancy/\" rel=\"noopener\" target=\"_blank\">foram ativadas ontem</a> após ficarem inativas por mais de 14 anos, com sua sequência levantando suspeitas. Notavelmente, a Lookonchain confirmou que se tratava de um Bitcoin OG movimentando seus ativos.\n\nCerca de 8 carteiras estavam ligadas ao \"whale\", cada uma contendo 10.000 BTC. Em particular, o \"whale\" moveu todos os bitcoins para 8 novos endereços, que ainda detêm os ativos no momento da escrita.\n\nNo entanto, Grogan destacou algumas razões pelas quais a movimentação pode não ter vindo do proprietário original da conta. Primeiro, o executivo da Coinbase disse que descobriu uma única transação teste na rede Bitcoin Cash de uma das carteiras do \"whale\", seguida pela transferência do valor total.\n\nIsso significa que a transação serviu para testar as chaves privadas silenciosamente na rede BCH, que atrai menos atenção do que a <a href=\"https://thecryptobasic.com/tag/bitcoin/\" rel=\"noopener\" target=\"_blank\">Bitcoin</a>. Mais detalhes revelam que a transação teste envolveu 10.000 BCH, no valor aproximado de US$ 4,9 milhões na época.\n\n<figure class=\"wp-caption alignnone\" style=\"width: 2626px;\"><img alt=\"\" height=\"1544\" src=\"https://pbs.twimg.com/media/GvB1v2RWoAAggYK?format=jpg&amp;name=4096x4096\" width=\"2626\" /><figcaption class=\"wp-caption-text\">Recibo da Transação Teste</figcaption></figure>\n\nApós um teste bem-sucedido, o \"whale\" moveu seus primeiros 10.000 BTC (US$ 1,09 bilhão) de \"12tLs9\" antes de transferir de todas as outras 7 carteiras ligadas ao proprietário, totalizando 80.009 BTC (US$ 8,6 bilhões).\n\nGrogan Destaca Movimentação Estranha\n\nAlém disso, Grogan compartilhou que as outras carteiras BCH afiliadas ao \"whale\" de BTC permanecem intocadas, exceto a envolvida na transação teste. Como resultado, ele questionou por que o proprietário não as moveu se sua intenção era simplesmente realocar seus ativos Bitcoin para novos endereços.\n\nGrogan descartou a possibilidade de ser uma carteira de exchange ou uma instituição movendo seus ativos devido à transação teste em BCH. Ele também destacou que o \"whale\" moveu os ativos manualmente, sugerindo ainda mais que se tratava de um indivíduo.\n\nNo entanto, ele enfatizou que estava \"especulando com base em poucas informações\" e não havia confirmado suas suspeitas. Mas, se estiver certo, o roubo de BTC seria o maior roubo da história da humanidade.\n\nNotavelmente, superaria o <a href=\"https://thecryptobasic.com/2025/02/22/north-korean-hackers-drain-1-46b-in-ethereum-from-bybit-heres-how-they-might-cash-out/\" rel=\"noopener\" target=\"_blank\">ataque à Bybit</a>, que atualmente é considerado o maior roubo em dólares na história das criptomoedas. Lembre-se que hackers drenaram US$ 1,5 bilhão da Bybit em fevereiro e <a href=\"https://thecryptobasic.com/2025/03/04/hackers-complete-movement-of-bybit-hack-loot-but-all-hope-is-not-lost/\" rel=\"noopener\" target=\"_blank\">movimentaram completamente</a> os fundos roubados.",
  "filename": "post_1751824860_maior-ataque-da-historia-executivo-da-coinbase-revela-por-que-transferencia-de-8.json"
}