{
  "id": "https://thecryptobasic.com/?p=128476",
  "title": "Why Doesn’t Ripple Adopt an XRP Reserve Strategy If XRP Is Going to $8,000 and Replacing SWIFT: Gary Cardone",
  "link": "https://thecryptobasic.com/2025/06/13/why-doesnt-ripple-adopt-an-xrp-reserve-strategy-if-xrp-is-going-to-8000-and-replacing-swift-gary-cardone/?utm_source=rss&utm_medium=rss&utm_campaign=why-doesnt-ripple-adopt-an-xrp-reserve-strategy-if-xrp-is-going-to-8000-and-replacing-swift-gary-cardone",
  "summary": "<b>Bitcoin critics are raising questions about the growing trend of crypto treasury strategies involving assets like XRP and Ethereum, in addition to BTC.</b>\n\nThe debate gained momentum after SharpLink Gaming, one of the first companies to adopt an Ethereum-based corporate reserve model, suffered a shocking 73% drop in after-hours trading. The collapse has reignited discussions about which digital assets are truly suitable for institutional treasuries.\n\nIn a tweet, Bitcoin proponent Steven Lubk",
  "published": "Fri, 13 Jun 2025 16:36:16 +0000",
  "content": "<b>Bitcoin critics are raising questions about the growing trend of crypto treasury strategies involving assets like XRP and Ethereum, in addition to BTC.</b>\n\nThe debate gained momentum after SharpLink Gaming, one of the first companies to adopt an Ethereum-based corporate reserve model, suffered a shocking 73% drop in after-hours trading. The collapse has reignited discussions about which digital assets are truly suitable for institutional treasuries.\n\nIn a tweet, Bitcoin proponent Steven Lubka pointed to SharpLink’s plunge as evidence that BTC remains the only reliable reserve asset. His statement suggests that altcoins like Ethereum are unsuitable for long-term corporate balance sheets, and financial expert Gary Cardone agrees with this opinion.\n\n<img alt=\"Image\" src=\"https://pbs.twimg.com/media/GtRbW-MW0AIwDEo?format=jpg&amp;name=medium\" />\n\nCardone <a href=\"https://x.com/GaryCardone/status/1933282429420052796\" rel=\"nofollow noopener\" target=\"_blank\">weighed</a> in on the conversation by turning the spotlight on Ripple. He questioned why Ripple has not transitioned into a company with an XRP reserve strategy, especially if the token is expected to appreciate dramatically and replace SWIFT as the global payments backbone.\n\nSpecifically, Cardone argues that if XRP truly has the potential to reach heights like $8,000, as suggested by some, then Ripple should already be leveraging the token as its core reserve asset. \n\nFor him, the fact that Ripple has not done so raises doubts about how much confidence the company itself places in XRP's long-term value.\nXRP Army Reacts\nUnsurprisingly, Cardone's comments did not go unanswered by XRP enthusiasts. Jason Jude called the criticism both contradictory and uninformed. He pointed out the irony of demanding that Ripple move to an XRP reserve model while critics often complain that Ripple already owns too much XRP.\n\nThis commentary highlighted the inconsistency among critics who question <a href=\"https://thecryptobasic.com/2025/06/05/ripple-releases-2-2b-in-xrp-from-escrow-for-june/\" rel=\"noopener\" target=\"_blank\">Ripple's 40% XRP holdings</a> yet expect the company to rely even more heavily on it as a reserve strategy.\n\nOthers accused Cardone of letting his Bitcoin-only bias cloud his judgment. Several community members argued that dismissing XRP could become one of his biggest investment regrets.\nCorporate Momentum Builds Behind XRP\nDespite the criticism, XRP continues to gain traction as a treasury asset among Nasdaq-listed firms. Several companies actively integrate XRP into their financial strategies, aligning with the push to diversify beyond Bitcoin.\n\nFor instance, Trident Digital Tech Holdings is <a href=\"https://thecryptobasic.com/2025/06/12/world-largest-xrp-reserve-nasdaq-listed-singapore-firm-announces-plans-to-raise-500m-for-xrp-treasury/\" rel=\"noopener\" target=\"_blank\">raising</a> $500 million to build one of the first major XRP treasuries. Also, Webus International in China is seeking $300 million in credit and plans to integrate Ripple's payment solutions.\n\nVivoPower International has <a href=\"https://thecryptobasic.com/2025/05/29/nasdaq-listed-vivopower-to-buy-and-hold-xrp-after-saudi-prince-met-with-trump/\" rel=\"noopener\" target=\"_blank\">earmarked</a> $100 million from its latest private round, while Wellgistics Health has secured a $50 million credit line for XRP accumulation.\n\nThis growing institutional interest suggests that some companies are betting on XRP as a payment utility and a long-term store of value.\nTreasury Strategy Works for Altcoins\nMeanwhile, the broader crypto community is also challenging Lubka’s claim that BTC is the only viable treasury asset in the wake of SharpLink Gaming's fallout. \n\nSpecifically, Solana enthusiasts cited data showing that DeFi Development Corp has experienced a massive 3,657% year-to-date gain after <a href=\"https://thecryptobasic.com/2025/04/23/solana-breaks-150-bulls-target-200-as-defi-dev-corp-buys-11-5m-in-sol/\" rel=\"noopener\" target=\"_blank\">adopting a SOL-based strategy months ago.</a>\n\nEven SharpLink Gaming’s monthly chart shows an impressive 882% gain, undermining the narrative that Bitcoin proponents are pushing.\n\nhttps://twitter.com/coryklippsten/status/1933340615808594160",
  "title_pt": "Ripple e XRP a US$ 8.000: Por que não adotar uma estratégia de reserva? (Gary Cardone)",
  "summary_pt": "Críticos do Bitcoin estão levantando questionamentos sobre a crescente tendência de estratégias de tesouraria cripto que envolvem ativos como XRP e Ethereum, além do BTC.\n\nO debate ganhou força após a SharpLink Gaming, uma das primeiras empresas a adotar um modelo de reserva corporativa baseado em Ethereum, sofrer uma queda chocante de 73% no pós-mercado. O colapso reacendeu discussões sobre quais ativos digitais são realmente adequados para tesourarias institucionais.\n\nEm um tweet, o defensor do Bitcoin Steven Lubk...",
  "content_pt": "Críticos do Bitcoin estão questionando a crescente tendência de estratégias de tesouraria cripto, envolvendo ativos como XRP e Ethereum, além do BTC.\n\nO debate ganhou força após a SharpLink Gaming, uma das primeiras empresas a adotar um modelo de reserva corporativa baseado em Ethereum, sofrer uma queda chocante de 73% nas negociações após o horário de fechamento. O colapso reacendeu discussões sobre quais ativos digitais são realmente adequados para tesourarias institucionais.\n\nEm um tweet, o defensor do Bitcoin, Steven Lubka, apontou a queda da SharpLink como evidência de que o BTC permanece o único ativo de reserva confiável. Sua declaração sugere que altcoins como Ethereum são inadequadas para balanços patrimoniais corporativos de longo prazo, e o especialista financeiro Gary Cardone concorda com essa opinião.\n\n<img alt=\"Imagem\" src=\"https://pbs.twimg.com/media/GtRbW-MW0AIwDEo?format=jpg&amp;name=medium\" />\n\nCardone <a href=\"https://x.com/GaryCardone/status/1933282429420052796\" rel=\"nofollow noopener\" target=\"_blank\">colocou</a> sua opinião na conversa, chamando atenção para a Ripple. Ele questionou por que a Ripple não fez a transição para uma empresa com uma estratégia de reserva em XRP, especialmente se o token espera-se que aprecie dramaticamente e substitua o SWIFT como a espinha dorsal dos pagamentos globais.\n\nEspecificamente, Cardone argumenta que, se o XRP realmente tem o potencial de atingir valores como US$ 8.000, como sugerido por alguns, então a Ripple já deveria estar utilizando o token como seu principal ativo de reserva.\n\nPara ele, o fato de a Ripple não ter feito isso levanta dúvidas sobre quanta confiança a própria empresa deposita no valor de longo prazo do XRP.\n\n**Reação do Exército XRP**\n\nSem surpresa, os comentários de Cardone não ficaram sem resposta pelos entusiastas do XRP. Jason Jude chamou a crítica de contraditória e desinformada. Ele apontou a ironia de exigir que a Ripple adote um modelo de reserva em XRP enquanto os críticos frequentemente reclamam que a Ripple já possui muito XRP.\n\nEste comentário destacou a incoerência entre os críticos que questionam as <a href=\"https://thecryptobasic.com/2025/06/05/ripple-releases-2-2b-in-xrp-from-escrow-for-june/\" rel=\"noopener\" target=\"_blank\">participações de 40% da Ripple em XRP</a>, mas esperam que a empresa dependa ainda mais dele como estratégia de reserva.\n\nOutros acusaram Cardone de deixar seu viés \"somente Bitcoin\" nublar seu julgamento. Vários membros da comunidade argumentaram que descartar o XRP pode se tornar um de seus maiores arrependimentos de investimento.\n\n**O Crescimento do Interesse Corporativo em XRP**\n\nApesar das críticas, o XRP continua ganhando tração como um ativo de tesouraria entre empresas listadas na Nasdaq. Várias empresas estão ativamente integrando o XRP em suas estratégias financeiras, alinhando-se com o impulso para diversificar além do Bitcoin.\n\nPor exemplo, a Trident Digital Tech Holdings está <a href=\"https://thecryptobasic.com/2025/06/12/world-largest-xrp-reserve-nasdaq-listed-singapore-firm-announces-plans-to-raise-500m-for-xrp-treasury/\" rel=\"noopener\" target=\"_blank\">levantando</a> US$ 500 milhões para construir uma das primeiras grandes tesourarias de XRP. Além disso, a Webus International, na China, está buscando US$ 300 milhões em crédito e planeja integrar as soluções de pagamento da Ripple.\n\nA VivoPower International <a href=\"https://thecryptobasic.com/2025/05/29/nasdaq-listed-vivopower-to-buy-and-hold-xrp-after-saudi-prince-met-with-trump/\" rel=\"noopener\" target=\"_blank\">destinou</a> US$ 100 milhões de sua última rodada privada, enquanto a Wellgistics Health garantiu uma linha de crédito de US$ 50 milhões para acumulação de XRP.\n\nEste crescente interesse institucional sugere que algumas empresas estão apostando no XRP como uma utilidade de pagamento e um armazenamento de valor de longo prazo.\n\n**Estratégias de Tesouraria Funcionam para Altcoins**\n\nEnquanto isso, a comunidade cripto mais ampla também está desafiando a afirmação de Lubka de que o BTC é o único ativo de tesouraria viável após a queda da SharpLink Gaming.\n\nEspecificamente, entusiastas da Solana citaram dados mostrando que a DeFi Development Corp experimentou um ganho massivo de 3.657% no ano até a data após <a href=\"https://thecryptobasic.com/2025/04/23/solana-breaks-150-bulls-target-200-as-defi-dev-corp-buys-11-5m-in-sol/\" rel=\"noopener\" target=\"_blank\">adotar uma estratégia baseada em SOL meses atrás.</a>\n\nAté mesmo o gráfico mensal da SharpLink Gaming mostra um ganho impressionante de 882%, minando a narrativa que os proponentes do Bitcoin estão promovendo.\n\nhttps://twitter.com/coryklippsten/status/1933340615808594160",
  "filename": "post_1749844951_ripple-e-xrp-a-us-8000-por-que-nao-adotar-uma-estrategia-de-reserva-gary-cardone.json"
}