{
  "id": "https://thecryptobasic.com/?p=128487",
  "title": "SharpLink Gaming Acquires $463M in Ethereum, Becomes Largest Public ETH Holder",
  "link": "https://thecryptobasic.com/2025/06/13/sharplink-gaming-acquires-463m-in-ethereum-becomes-largest-public-eth-holder/?utm_source=rss&utm_medium=rss&utm_campaign=sharplink-gaming-acquires-463m-in-ethereum-becomes-largest-public-eth-holder",
  "summary": "<b>Nasdaq-listed SharpLink Gaming has made a groundbreaking move involving Ethereum as part of its treasury strategy, becoming the largest public holder of ETH.</b>\n\nIn a <a href=\"https://www.globenewswire.com/news-release/2025/06/13/3098979/0/en/SharpLink-Gaming-Acquires-176-271-ETH-for-463-Million-Officially-Becoming-Largest-Publicly-Traded-ETH-Holder.html\" rel=\"noopener\" target=\"_blank\">press statement</a> today, the firm disclosed that it acquired 176,270.69 ETH for approximately $462.95 mil",
  "published": "Fri, 13 Jun 2025 15:27:46 +0000",
  "content": "<b>Nasdaq-listed SharpLink Gaming has made a groundbreaking move involving Ethereum as part of its treasury strategy, becoming the largest public holder of ETH.</b>\n\nIn a <a href=\"https://www.globenewswire.com/news-release/2025/06/13/3098979/0/en/SharpLink-Gaming-Acquires-176-271-ETH-for-463-Million-Officially-Becoming-Largest-Publicly-Traded-ETH-Holder.html\" rel=\"noopener\" target=\"_blank\">press statement</a> today, the firm disclosed that it acquired 176,270.69 ETH for approximately $462.95 million, at an average acquisition price of $2,626 per ETH.\n\nWith this aggressive purchase, SharpLink Gaming has secured its position as the world's largest publicly traded ETH holder. This acquisition places SharpLink second only to the <a href=\"https://thecryptobasic.com/2025/05/14/ethereum-foundation-announces-trillion-dollar-security-initiative-details/\" rel=\"noopener\" target=\"_blank\">Ethereum Foundation</a> in total ETH holdings.\n\nThe massive transaction, executed during a period of bearish ETH performance, represents a significant institutional vote of confidence in Ethereum's long-term value and utility.\nETH Becomes Primary Treasury Reserve Asset\nNotably, SharpLink has officially adopted ETH as its primary treasury reserve asset. This decision makes the firm the first Nasdaq-listed company to do so.\n\nSharpLink's CEO, Rob Phythian, explained that the decision reflects its strong belief in Ethereum as a cornerstone of the future digital economy and decentralized technologies. He also emphasized that choosing ETH as the company's main treasury reserve asset is a firm confidence in its potential as programmable, income-generating digital capital.\n\nSharpLink also revealed that over 95% of its ETH holdings are in active <a href=\"https://thecryptobasic.com/2025/04/15/us-sec-extends-first-decision-deadline-on-adding-staking-to-the-grayscale-ethereum-etfs/\" rel=\"noopener\" target=\"_blank\">staking</a> or liquid staking solutions. This helps to secure the Ethereum network while generating native yield.\n\nThis dual-benefit strategy positions SharpLink to participate in the network's growth while earning passive income through ETH rewards.\nCapital Raised via $1B ATM Program Fuels Crypto Play\nNotably, from May 30 to June 12, 2025, SharpLink raised approximately $79 million in gross proceeds through its $1 billion at-the-market (ATM) equity program. The majority of these funds went into acquiring additional ETH.\n\nSince June 2, 2025, these cumulative ETH purchases have driven ETH-per-share growth of 11.8%, enhancing shareholder value through digital asset exposure.\nEthereum Co-Founder Joseph Lubin Backs the Move\nJoseph Lubin, Co-Founder of Ethereum and Chairman of SharpLink, praised the company's strategy, calling it \"a pivotal milestone for the institutional adoption of Ethereum.\"\n\nLubin highlighted the timing of the move, noting that it comes amid growing momentum in the U.S. Congress to pass digital asset and stablecoin legislation. He suggested the passage could serve as a broader catalyst for Ethereum's mainstream adoption.\n\nUltimately, SharpLink's ETH-centric treasury strategy aligns with a broader trend among public companies seeking exposure to digital assets. The move echoes <a href=\"https://thecryptobasic.com/2025/05/16/14-us-states-hold-632m-in-microstrategy-stock-as-public-funds-increase-bitcoin-exposure/\" rel=\"noopener\" target=\"_blank\">MicroStrategy's historic embrace</a> of Bitcoin.\nSharpLink's Stock Crashes 73%\nMeanwhile, just hours after the announcement, shares of SharpLink Gaming tumbled more than 70%. Analysts suggest the dramatic decline was due to investor confusion, with many misinterpreting a routine SEC filing as insider selling. The resulting panic overshadowed the company's bold $463 million Ethereum treasury strategy.\n\nhttps://twitter.com/ethereumJoseph/status/1933293672600064066",
  "title_pt": "SharpLink Gaming adquire US$ 463 milhões em Ethereum, tornando-se a maior detentora pública de ETH",
  "summary_pt": "A SharpLink Gaming, listada na Nasdaq, fez um movimento inovador envolvendo Ethereum como parte de sua estratégia de tesouraria, tornando-se a maior detentora pública de ETH.\n\nEm um [comunicado à imprensa](https://www.globenewswire.com/news-release/2025/06/13/3098979/0/en/SharpLink-Gaming-Acquires-176-271-ETH-for-463-Million-Officially-Becoming-Largest-Publicly-Traded-ETH-Holder.html) divulgado hoje, a empresa revelou ter adquirido 176.270,69 ETH por aproximadamente US$ 462,95 milhões.",
  "content_pt": "A SharpLink Gaming, empresa listada na Nasdaq, fez um movimento inovador envolvendo Ethereum como parte de sua estratégia de tesouraria, tornando-se a maior detentora pública de ETH.\n\nEm um comunicado à imprensa divulgado hoje, a empresa revelou ter adquirido 176.270,69 ETH por aproximadamente US$ 462,95 milhões, a um preço médio de aquisição de US$ 2.626 por ETH.\n\nCom essa compra agressiva, a SharpLink Gaming garantiu sua posição como a maior detentora de ETH entre as empresas de capital aberto do mundo. Essa aquisição coloca a SharpLink em segundo lugar apenas à Ethereum Foundation em termos de posse total de ETH.\n\nA transação maciça, executada durante um período de desempenho negativo do ETH, representa um voto de confiança institucional significativo no valor e na utilidade de longo prazo do Ethereum.\n\n**ETH se torna o principal ativo de reserva da tesouraria**\n\nÉ importante destacar que a SharpLink adotou oficialmente o ETH como seu principal ativo de reserva da tesouraria. Essa decisão a torna a primeira empresa listada na Nasdaq a fazê-lo.\n\nO CEO da SharpLink, Rob Phythian, explicou que a decisão reflete sua forte crença no Ethereum como pedra angular da futura economia digital e das tecnologias descentralizadas. Ele também enfatizou que a escolha do ETH como principal ativo de reserva da tesouraria da empresa demonstra firme confiança em seu potencial como capital digital programável e gerador de renda.\n\nA SharpLink também revelou que mais de 95% de suas participações em ETH estão em soluções ativas de staking ou liquid staking. Isso ajuda a proteger a rede Ethereum enquanto gera rendimentos nativos.\n\nEssa estratégia de duplo benefício posiciona a SharpLink para participar do crescimento da rede enquanto obtém renda passiva por meio de recompensas em ETH.\n\n**Capital levantado por meio do programa ATM de US$ 1 bilhão impulsiona investimento em criptomoedas**\n\nDe 30 de maio a 12 de junho de 2025, a SharpLink arrecadou aproximadamente US$ 79 milhões em recursos brutos por meio de seu programa de ações \"at-the-market\" (ATM) de US$ 1 bilhão. A maior parte desses fundos foi utilizada para adquirir ETH adicional.\n\nDesde 2 de junho de 2025, essas compras cumulativas de ETH impulsionaram o crescimento do ETH por ação em 11,8%, melhorando o valor para o acionista por meio da exposição a ativos digitais.\n\n**Cofundador do Ethereum, Joseph Lubin, apoia a iniciativa**\n\nJoseph Lubin, cofundador do Ethereum e presidente da SharpLink, elogiou a estratégia da empresa, chamando-a de \"marco crucial para a adoção institucional do Ethereum\".\n\nLubin destacou o momento da iniciativa, observando que ela ocorre em meio ao crescente impulso no Congresso dos EUA para aprovar legislação sobre ativos digitais e stablecoins. Ele sugeriu que a aprovação poderia servir como um catalisador mais amplo para a adoção generalizada do Ethereum.\n\nEm última análise, a estratégia de tesouraria centrada em ETH da SharpLink está alinhada com uma tendência mais ampla entre empresas de capital aberto que buscam exposição a ativos digitais. A iniciativa reflete a histórica adoção de Bitcoin pela MicroStrategy.\n\n**Ações da SharpLink caem 73%**\n\nEnquanto isso, poucas horas após o anúncio, as ações da SharpLink Gaming despencaram mais de 70%. Analistas sugerem que a queda dramática se deve à confusão dos investidores, com muitos interpretando erroneamente um arquivamento rotineiro na SEC como venda interna. O pânico resultante ofuscou a ousada estratégia de tesouraria de US$ 463 milhões em Ethereum da empresa.\n\nhttps://twitter.com/ethereumJoseph/status/1933293672600064066",
  "filename": "post_1749855610_sharplink-gaming-adquire-us-463-milhoes-em-ethereum-tornando-se-a-maior-detentor.json"
}