{
  "id": "https://thecryptobasic.com/?p=130595",
  "title": "Here’s The Price and Timeline Where Critics Will Hate XRP Even More: Expert",
  "link": "https://thecryptobasic.com/2025/07/06/heres-the-price-and-timeline-where-critics-will-hate-xrp-even-more-expert/?utm_source=rss&utm_medium=rss&utm_campaign=heres-the-price-and-timeline-where-critics-will-hate-xrp-even-more-expert",
  "summary": "<strong>Famous XRP community figure Alex Cobb issues a bold forecast for XRP, predicting a double-digit price target by the end of 2025. </strong>\n\nCobb issued the prediction while responding to a critic who publicly declared his hatred for XRP. This comes after XRPL co-founder Arthur Britto <a href=\"https://thecryptobasic.com/2025/06/24/xrpl-founder-who-predicted-xrp-to-10000-tweets-after-13-years-silence/\" rel=\"noopener\" target=\"_blank\">broke</a> his 13-year silence on X last month, posting a ",
  "published": "Sun, 06 Jul 2025 06:11:15 +0000",
  "content": "<strong>Famous XRP community figure Alex Cobb issues a bold forecast for XRP, predicting a double-digit price target by the end of 2025. </strong>\n\nCobb issued the prediction while responding to a critic who publicly declared his hatred for XRP. This comes after XRPL co-founder Arthur Britto <a href=\"https://thecryptobasic.com/2025/06/24/xrpl-founder-who-predicted-xrp-to-10000-tweets-after-13-years-silence/\" rel=\"noopener\" target=\"_blank\">broke</a> his 13-year silence on X last month, posting a single emoji. \n\nAs reported earlier, Britto’s sudden reappearance on X sparked reactions among members of the XRP community. Cobb also reacted, sharing a screenshot of an animated King character with the caption, “The lore with XRP is crazy.” \n\nHowever, one critic scoffed at the post, saying he hates XRP because of the ‘bullshit’ image Cobb shared. “This isn’t how you build a new foundation.. It is a GD JOKE!!!”  the user wrote. \nYou’ll Soon Hate XRP Even More \nInterestingly, Cobb cleverly <a href=\"https://x.com/Cobb_XRPL/status/1941300017597383062\" rel=\"nofollow noopener\" target=\"_blank\">countered</a> the user’s dismissal of XRP by offering a hyper-bullish price target for the fourth-biggest cryptocurrency by market cap. The popular community figure speculated that the user’s hatred for XRP will intensify later this year when its price soars to $15 by December 2025.  \n\nIf the prediction comes true, the hatred Cobb envisages for the critic might manifest as frustration over missing out on massive profits. Cobb’s commentary is a clever way of saying people trash-talking XRP at the moment might regret doing so if its price rallies to $15 by December 2025. \nPath to $15 \nThe projected $15 target represents a 581% increase from the current price of $ 2.20. Hitting this target would mark a new all-time high for XRP, surpassing the previous $3.84 record set in January 2018 by 290.62%. \n\nThe impact of this surge will be tremendous for early investors. For instance, a portfolio containing 1,000 XRP will increase to $15,000 if the price soars to $15 compared to its current value of $2,200. \nXRP to $15 Price Forecasts \nMeanwhile, Cobb is not the only market commentator who believes XRP could surge to the $15 price target. In May, prominent crypto researcher Rob Cunningham <a href=\"https://thecryptobasic.com/2025/05/16/researcher-explains-how-xrp-could-surge-to-5-15-in-short-term-and-20-75-in-long-term/\" rel=\"noopener\" target=\"_blank\">predicted</a> that XRP would rise to around $15 in the short term, attributing the move to supply pressure from Hidden Road’s use of the XRPL. \n\nSimilarly, popular crypto chartist Ali Martinez <a href=\"https://thecryptobasic.com/2025/05/12/analysts-see-xrp-reaching-7-to-15-citing-cycle-blow-off-top-and-symmetrical-triangle-breakout/\" rel=\"noopener\" target=\"_blank\">forecasted</a> XRP’s climb to the $15 territory after the token broke above a multi-year symmetrical triangle. \n\nEarlier this year, community analyst Zach Rector speculated that XRP could <a href=\"https://thecryptobasic.com/2025/04/15/finance-analyst-shows-how-xrp-price-could-hit-15-with-etf-inflows-using-market-cap-multiplier/\" rel=\"noopener\" target=\"_blank\">hit</a> the $15 price target if its upcoming spot-based ETFs attract significant inflows. Whether the $15 forecast for XRP will materialize remains to be seen.",
  "title_pt": "Aqui está o preço e a linha do tempo em que os críticos odiarão ainda mais o XRP: especialista",
  "summary_pt": "A figura influente da comunidade XRP, Alex Cobb, fez uma previsão ousada para o XRP, prevendo um preço de dois dígitos até o final de 2025.\n\nCobb fez a previsão ao responder a um crítico que publicamente declarou seu ódio pelo XRP. Isso ocorre depois que Arthur Britto, cofundador do XRPL, quebrou seu silêncio de 13 anos no X no mês passado, postando um...",
  "content_pt": "A figura proeminente da comunidade XRP, Alex Cobb, fez uma previsão ousada para o XRP, prevendo um preço de dois dígitos até o final de 2025.\n\nCobb fez a previsão ao responder a um crítico que publicamente declarou seu ódio pelo XRP. Isso ocorreu após o cofundador do XRPL, Arthur Britto, quebrar seu silêncio de 13 anos no X no mês passado, postando apenas um emoji.\n\nComo relatado anteriormente, o reaparecimento repentino de Britto no X provocou reações entre os membros da comunidade XRP. Cobb também reagiu, compartilhando uma captura de tela de um personagem de rei animado com a legenda: \"A história com o XRP é louca\".\n\nNo entanto, um crítico zombou da postagem, dizendo que odeia o XRP por causa da imagem \"bobagem\" que Cobb compartilhou. \"Não é assim que se constrói uma nova fundação... É uma PIADA!\", escreveu o usuário.\n\n**Você em breve odiará ainda mais o XRP**\n\nCuriosamente, Cobb respondeu inteligentemente à rejeição do XRP pelo usuário, oferecendo uma meta de preço extremamente otimista para a quarta maior criptomoeda por capitalização de mercado. A popular figura da comunidade especulou que o ódio do usuário pelo XRP se intensificará mais tarde este ano, quando seu preço disparar para US$ 15 em dezembro de 2025.\n\nSe a previsão se concretizar, o ódio que Cobb prevê para o crítico pode se manifestar como frustração por perder lucros massivos. O comentário de Cobb é uma maneira inteligente de dizer que as pessoas que criticam o XRP no momento podem se arrepender de fazê-lo se seu preço subir para US$ 15 em dezembro de 2025.\n\n**Caminho para US$ 15**\n\nA meta projetada de US$ 15 representa um aumento de 581% em relação ao preço atual de US$ 2,20. Alcançar essa meta marcaria uma nova máxima histórica para o XRP, superando o recorde anterior de US$ 3,84 estabelecido em janeiro de 2018 em 290,62%.\n\nO impacto dessa alta será tremendo para os investidores iniciais. Por exemplo, um portfólio contendo 1.000 XRP aumentará para US$ 15.000 se o preço subir para US$ 15, em comparação com seu valor atual de US$ 2.200.\n\n**Previsões de preço do XRP para US$ 15**\n\nEnquanto isso, Cobb não é o único comentarista de mercado que acredita que o XRP pode disparar para a meta de preço de US$ 15. Em maio, o proeminente pesquisador de criptomoedas Rob Cunningham previu que o XRP subiria para cerca de US$ 15 em curto prazo, atribuindo a movimentação à pressão de oferta do uso do XRPL pela Hidden Road.\n\nDa mesma forma, o popular analista de gráficos de criptomoedas Ali Martinez previu a alta do XRP para a faixa de US$ 15 depois que o token ultrapassou um triângulo simétrico de vários anos.\n\nNo início deste ano, o analista da comunidade Zach Rector especulou que o XRP poderia atingir a meta de preço de US$ 15 se seus próximos ETFs baseados em spot atraírem fluxos significativos. Se a previsão de US$ 15 para o XRP se concretizará, ainda está por ver.",
  "filename": "post_1751824807_aqui-esta-o-preco-e-a-linha-do-tempo-em-que-os-criticos-odiarao-ainda-mais-o-xrp.json"
}