{
  "id": "https://thecryptobasic.com/?p=128458",
  "title": "US Politician Pushing for New Bank Charter That Could Let Ripple Get a Banking License",
  "link": "https://thecryptobasic.com/2025/06/13/us-politician-pushing-for-new-bank-charter-that-could-let-ripple-get-a-banking-license/?utm_source=rss&utm_medium=rss&utm_campaign=us-politician-pushing-for-new-bank-charter-that-could-let-ripple-get-a-banking-license",
  "summary": "<strong>US politician and former congressional candidate Greg Kidd says he is working on a bank charter that could allow firms like Ripple to get banking licenses.</strong>\n\nKidd, a co-founder of Haka Yaka Ventures and owner of Vast Bank, said this at the just-concluded XRP Las Vegas conference. In a one-on-one interview with journalist Eleanor Terrett, Kidd discussed his involvement in politics and revealed efforts to introduce this new type of bank charter.\nA New Bank Charter that Could Allow ",
  "published": "Fri, 13 Jun 2025 13:27:38 +0000",
  "content": "<strong>US politician and former congressional candidate Greg Kidd says he is working on a bank charter that could allow firms like Ripple to get banking licenses.</strong>\n\nKidd, a co-founder of Haka Yaka Ventures and owner of Vast Bank, said this at the just-concluded XRP Las Vegas conference. In a one-on-one interview with journalist Eleanor Terrett, Kidd discussed his involvement in politics and revealed efforts to introduce this new type of bank charter.\nA New Bank Charter that Could Allow Ripple to Procure a Banking License\nKidd explained that although he no longer runs for office, he still works closely on financial legislation. He's now focused on creating a special charter designed strictly for banks that deal only with deposits and payments. It eliminates the need for physical branches or lending.\n\nhttps://twitter.com/DigPerspectives/status/1933157935716135154\n\nThis idea aims to make it easier for digital-first businesses to enter the space. He said this new approach would give companies like Ripple a path to owning a banking license, even though he clarified he wasn't speaking for Ripple or suggesting they plan to apply. \n\nNotably, his larger goal is to break up the dominance that traditional banks hold and make banking more accessible to new firms, whether they're digital wallets, remittance companies, or even major retailers. \nGreg Kidd: Cost of Moving Money Should be Minimal\nSpeaking further, Kidd pointed out that the cost of processing payments on the XRP Ledger is <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2023/05/10/xrp-transaction-fees-at-0-0002-while-bitcoin-fees-surpass-20/\" rel=\"noopener\" target=\"_blank\">nearly zero</a>, so the price of sending money should reflect that. He sees payments as something that should work like a public utility: low-cost and available to everyone.\n\nInterestingly, Kidd criticized the current system, where only a few people, including himself and Jackie Reses from Lead Bank, have managed to secure banking licenses under the Biden administration. \n\nThe American entrepreneur called for a return to a time when competition, innovation, and inclusion drove the banking sector before the <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2020/12/25/will-bitcoin-help-to-beat-the-financial-crisis/\" rel=\"noopener\" target=\"_blank\">financial crisis</a> of 2008 disrupted it.\nRipple and the Banking Scene\nMeanwhile, Ripple has already made moves within the banking sector. In June 2024, the company became a Platinum Member of the American Bankers Association (ABA).\n\n<figure class=\"wp-caption alignnone\" id=\"attachment_128459\" style=\"width: 900px;\"><figure><img alt=\"Ripple Platinum Member of the American Bankers Association\" class=\"size-full wp-image-128459\" height=\"334\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Ripple-Platinum-Member-of-the-American-Bankers-Association.png\" title=\"Ripple Platinum Member of the American Bankers Association\" width=\"900\" /><figcaption>Ripple Platinum Member of the American Bankers Association</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-128459\">Ripple Platinum Member of the American Bankers Association</figcaption></figure>\n\nThis top membership gives Ripple greater visibility and stronger access to banking leaders and policymakers, putting the blockchain payment firm in a better position to influence the direction of financial services.\n\nMoreover, Ripple CEO Brad Garlinghouse, speaking at the same Las Vegas event, <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/02/ripple-ceo-says-ripple-will-rewire-the-entire-banking-system/\" rel=\"noopener\" target=\"_blank\">confirmed</a> that the firm plans to rewire the banking system. According to him, Ripple wants to help banks move money faster and more cheaply by cutting out intermediaries and removing the need for pre-funded accounts. \n\nGarlinghouse stressed that Ripple doesn't aim to replace banks. Instead, the firm wants to work with them to speed up and simplify cross-border payments.\nPutting the Banking Industry On-chain\nMeanwhile, during his interview, Kidd also <a class=\"editor-rtfLink\" href=\"https://x.com/DigPerspectives/status/1933151454258155721\" rel=\"nofollow noopener\" target=\"_blank\">discussed</a> Vast Bank, his latest venture. He explained that the reason he decided to buy a U.S. bank was to put real U.S. dollars directly on the blockchain. \n\nHe believes this will replace outdated banking ledgers with secure, real-time records on networks like the XRP Ledger. These on-chain dollars, backed by FDIC insurance and regulatory protections, could become available to people around the world.\n\nKidd also revealed that he invested in the Bank of London and is closing a deal in Europe. His goal is to bring dollars, pounds, and euros onto blockchain networks so that banking can run non-stop, 24/7, with digital money that never leaves the chain.",
  "title_pt": "Político dos EUA pressiona por nova carta bancária que pode permitir licença bancária para Ripple",
  "summary_pt": "O político americano e ex-candidato ao congresso, Greg Kidd, afirma estar trabalhando em um novo tipo de carta bancária que permitiria a empresas como a Ripple obterem licenças bancárias.\n\nKidd, co-fundador da Haka Yaka Ventures e proprietário do Vast Bank, fez essa declaração na recém-concluída conferência XRP Las Vegas. Em uma entrevista individual com a jornalista Eleanor Terrett, Kidd discutiu seu envolvimento na política e revelou os esforços para introduzir este novo tipo de carta bancária.  Um novo tipo de carta bancária que poderia permitir...",
  "content_pt": "O político americano e ex-candidato ao congresso, Greg Kidd, afirma estar trabalhando em um novo tipo de carta de banco que permitiria a empresas como a Ripple obter licenças bancárias.\n\nKidd, cofundador da Haka Yaka Ventures e proprietário do Vast Bank, fez essa declaração na recém-concluída conferência XRP Las Vegas. Em uma entrevista individual com a jornalista Eleanor Terrett, Kidd discutiu seu envolvimento na política e revelou os esforços para introduzir esse novo tipo de carta de banco.\n\n**Um Novo Tipo de Carta Bancária que Poderia Permitir que a Ripple Obtivesse uma Licença Bancária**\n\nKidd explicou que, embora não mais concorra a cargos públicos, ainda trabalha ativamente em legislação financeira. Atualmente, ele está focado na criação de uma carta especial, projetada estritamente para bancos que lidam apenas com depósitos e pagamentos.  Isso elimina a necessidade de agências físicas ou operações de crédito.\n\nEssa ideia visa facilitar a entrada de empresas digitais no setor. Ele disse que essa nova abordagem daria a empresas como a Ripple um caminho para obter uma licença bancária, embora tenha esclarecido que não estava falando em nome da Ripple nem sugerindo que ela planeja se candidatar.\n\nNotavelmente, seu objetivo maior é quebrar o domínio dos bancos tradicionais e tornar o sistema bancário mais acessível a novas empresas, sejam carteiras digitais, empresas de remessa ou até mesmo grandes varejistas.\n\n**Greg Kidd: O Custo de Movimentar Dinheiro Deve Ser Mínimo**\n\nProsseguindo, Kidd apontou que o custo de processar pagamentos no XRP Ledger é <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2023/05/10/xrp-transaction-fees-at-0-0002-while-bitcoin-fees-surpass-20/\" rel=\"noopener\" target=\"_blank\">quase zero</a>, portanto, o preço de enviar dinheiro deveria refletir isso. Ele vê os pagamentos como algo que deveria funcionar como um serviço público: baixo custo e disponível para todos.\n\nCuriosamente, Kidd criticou o sistema atual, onde apenas algumas pessoas, incluindo ele mesmo e Jackie Reses do Lead Bank, conseguiram obter licenças bancárias sob a administração Biden.\n\nO empreendedor americano pediu um retorno a uma época em que a competição, a inovação e a inclusão impulsionavam o setor bancário antes da <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2020/12/25/will-bitcoin-help-to-beat-the-financial-crisis/\" rel=\"noopener\" target=\"_blank\">crise financeira</a> de 2008 o interromper.\n\n**Ripple e o Cenário Bancário**\n\nEnquanto isso, a Ripple já fez movimentos dentro do setor bancário. Em junho de 2024, a empresa tornou-se membro Platinum da American Bankers Association (ABA).\n\n<figure class=\"wp-caption alignnone\" id=\"attachment_128459\" style=\"width: 900px;\"><figure><img alt=\"Ripple Platinum Member of the American Bankers Association\" class=\"size-full wp-image-128459\" height=\"334\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Ripple-Platinum-Member-of-the-American-Bankers-Association.png\" title=\"Ripple Platinum Member of the American Bankers Association\" width=\"900\" /><figcaption>Ripple Platinum Member of the American Bankers Association</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment_128459\">Ripple Platinum Member of the American Bankers Association</figcaption></figure>\n\nEssa alta categoria de membro dá à Ripple maior visibilidade e acesso mais forte a líderes bancários e formuladores de políticas, colocando a empresa de pagamentos blockchain em uma posição melhor para influenciar a direção dos serviços financeiros.\n\nAlém disso, o CEO da Ripple, Brad Garlinghouse, falando no mesmo evento em Las Vegas, <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/02/ripple-ceo-says-ripple-will-rewire-the-entire-banking-system/\" rel=\"noopener\" target=\"_blank\">confirmou</a> que a empresa planeja reformular o sistema bancário. Segundo ele, a Ripple quer ajudar os bancos a mover dinheiro mais rápido e mais barato, eliminando intermediários e a necessidade de contas pré-financiadas.\n\nGarlinghouse enfatizou que a Ripple não pretende substituir os bancos. Em vez disso, a empresa quer trabalhar com eles para acelerar e simplificar os pagamentos transfronteiriços.\n\n**Colocando a Indústria Bancária On-chain**\n\nEnquanto isso, durante sua entrevista, Kidd também <a class=\"editor-rtfLink\" href=\"https://x.com/DigPerspectives/status/1933151454258155721\" rel=\"nofollow noopener\" target=\"_blank\">discutiu</a> o Vast Bank, seu último empreendimento. Ele explicou que a razão pela qual decidiu comprar um banco americano foi para colocar dólares americanos reais diretamente no blockchain.\n\nEle acredita que isso substituirá os livros contábeis bancários desatualizados por registros seguros e em tempo real em redes como o XRP Ledger. Esses dólares on-chain, respaldados por seguro FDIC e proteções regulatórias, poderiam ficar disponíveis para pessoas em todo o mundo.\n\nKidd também revelou que investiu no Bank of London e está fechando um negócio na Europa. Seu objetivo é levar dólares, libras e euros para redes blockchain para que os serviços bancários possam funcionar ininterruptamente, 24 horas por dia, 7 dias por semana, com dinheiro digital que nunca sai da cadeia.",
  "filename": "post_1749855645_politico-dos-eua-pressiona-por-nova-carta-bancaria-que-pode-permitir-licenca-ban.json"
}