{
  "id": "https://thecryptobasic.com/?p=128454",
  "title": "Ripple May Someday Buy Up Some Legacy Companies and Put Them Out of Their Misery: Greg Kidd",
  "link": "https://thecryptobasic.com/2025/06/13/ripple-may-someday-buy-up-some-legacy-companies-and-put-them-out-of-their-misery-greg-kidd/?utm_source=rss&utm_medium=rss&utm_campaign=ripple-may-someday-buy-up-some-legacy-companies-and-put-them-out-of-their-misery-greg-kidd",
  "summary": "<strong>Crypto pioneer and former Ripple exec Greg Kidd outlines a vision for blockchain-powered banking, suggesting Ripple could transform traditional finance by absorbing outdated institutions.</strong>\n\nKidd <a href=\"https://youtu.be/9Fobp86iy1o?si=GqXUfMEmB3TUQ99f\" rel=\"nofollow noopener\" target=\"_blank\">shared</a> these insights at the third annual XRP Las Vegas conference during a fireside chat with journalist Eleanor Terrett. He reflected on his early days with Ripple and described a futu",
  "published": "Fri, 13 Jun 2025 13:16:22 +0000",
  "content": "<strong>Crypto pioneer and former Ripple exec Greg Kidd outlines a vision for blockchain-powered banking, suggesting Ripple could transform traditional finance by absorbing outdated institutions.</strong>\n\nKidd <a href=\"https://youtu.be/9Fobp86iy1o?si=GqXUfMEmB3TUQ99f\" rel=\"nofollow noopener\" target=\"_blank\">shared</a> these insights at the third annual XRP Las Vegas conference during a fireside chat with journalist Eleanor Terrett. He reflected on his early days with Ripple and described a future beyond crypto as a speculative asset. For him, the endgame is full integration of blockchain into the core of the global financial system.\n\nKidd recalled that when he joined Ripple in 2012, there were only 188 accounts on the ledger. \n\n<i>\"It was like being there with the disciples,\" </i>he said.<i> \"But even then, the vision was clear: money should move at the speed of the internet.\"</i>\nVast Bank, Tokenized Dollars, and a New Financial Backbone\nToday, Kidd leads an initiative to bring the banking system on-chain by acquiring Vast Bank, a nationally chartered institution regulated by the OCC and the Federal Reserve. He aims to issue FDIC-insured U.S. dollar deposit tokens directly on blockchain networks, including the XRP Ledger.\n\nUnlike stablecoins, which must be backed 1:1 and are limited in scope, Kidd's approach leverages fractional reserve banking.\n\n<i>We're eight times more capital efficient than stablecoins,\" </i>he said.<i> \"And we can pay interest, offer consumer protections, and keep money moving around the clock.\"</i>\n\nThis on-chain model serves crypto-native developers and users while undercutting the legacy system's inefficiencies.\n\nKidd sees a world where people everywhere can hold and use digital U.S. dollars that never technically leave the banking system, even when sent across borders. He argues that if funds remain on the ledger and in dollar form, traditional remittances become obsolete. \nOpen Banking and Fair Access\nThe conversation also touched on the evolution of U.S. financial regulation since the 2024 election. Kidd credited the new administration with <a href=\"https://thecryptobasic.com/2025/03/08/us-federal-banking-regulator-clears-banks-to-engage-in-bitcoin-and-crypto-activities/\" rel=\"noopener\" target=\"_blank\">removing</a> \"reputational risk\" from federal exam guidelines. This obstacle had previously kept many legal industries, including crypto, cannabis, and adult content, out of the banking system.\n\n<i>\"We call them the consensual vices,\" </i>he said.<i> \"If you're legal and licensed, you should be banked. Period.\"</i>\n\nMeanwhile, Kidd's political activism hasn't slowed. He now advocates for a new banking charter focused solely on deposits and payments. This would allow fintech firms like Ripple to obtain banking licenses without building brick-and-mortar branches or issuing loans.\n\nKidd eyes a future where banking is as accessible and seamless as breathing air.\n\n<i>\"Payments should be free. Banking should be universal. And blockchain makes that possible,\" </i>he said.<i> \"What Ripple and others are doing now is building that future.\"</i>\nRipple to Put Legacy Companies Out of Their Misery\nAs Ripple <a href=\"https://thecryptobasic.com/2025/05/14/no-xrp-as-ripple-to-use-rlusd-in-hidden-road-deal-for-300-financial-institutions/\" rel=\"noopener\" target=\"_blank\">expands its investments</a> and navigates global markets post-lawsuit, Kidd predicts the company will play a central role in overhauling traditional finance.\n\nWhen asked where he sees Ripple in ten years, Kidd said the company will become a fully integrated blockchain firm. He even suggested Ripple may someday buy up some legacy companies and \"put them out of their misery.\"\n\nBy that, he means acquiring financial institutions still operating on outdated infrastructure and migrating them onto more efficient blockchain rails.\n\nhttps://twitter.com/DigPerspectives/status/1933162109983977969\n\nHis comments highlight Ripple's long-term ambition not just to challenge but to absorb and transform legacy financial infrastructure.",
  "title_pt": "Ripple pode um dia comprar empresas tradicionais e acabar com seu sofrimento: Greg Kidd",
  "summary_pt": "O pioneiro em criptomoedas e ex-executivo da Ripple, Greg Kidd, delineou uma visão para um sistema bancário impulsionado por blockchain, sugerindo que a Ripple poderia transformar as finanças tradicionais absorvendo instituições obsoletas.\n\nKidd <a href=\"https://youtu.be/9Fobp86iy1o?si=GqXUfMEmB3TUQ99f\" rel=\"nofollow noopener\" target=\"_blank\">compartilhou</a> essas ideias na terceira conferência anual XRP Las Vegas, durante uma conversa informal com a jornalista Eleanor Terrett. Ele refletiu sobre seus primeiros dias na Ripple e descreveu um futuro...",
  "content_pt": "O pioneiro em criptomoedas e ex-executivo da Ripple, Greg Kidd, delineou uma visão para um sistema bancário impulsionado por blockchain, sugerindo que a Ripple poderia transformar as finanças tradicionais absorvendo instituições obsoletas.\n\nKidd <a href=\"https://youtu.be/9Fobp86iy1o?si=GqXUfMEmB3TUQ99f\" rel=\"nofollow noopener\" target=\"_blank\">compartilhou</a> essas ideias na terceira conferência anual XRP Las Vegas, durante uma conversa informal com a jornalista Eleanor Terrett. Ele refletiu sobre seus primeiros dias na Ripple e descreveu um futuro além da criptomoeda como um ativo especulativo. Para ele, o objetivo final é a integração completa da blockchain no cerne do sistema financeiro global.\n\nKidd lembrou que, quando ingressou na Ripple em 2012, havia apenas 188 contas no ledger.\n\n_\"Era como estar lá com os discípulos_\", disse ele. _\"Mas mesmo assim, a visão era clara: o dinheiro deveria se mover na velocidade da internet.\"_\n\nVast Bank, Dólares Tokenizados e uma Nova Estrutura Financeira\n\nHoje, Kidd lidera uma iniciativa para levar o sistema bancário *on-chain* por meio da aquisição do Vast Bank, uma instituição com carta nacional regulamentada pelo OCC e pelo Federal Reserve. Seu objetivo é emitir tokens de depósito em dólar americano com seguro FDIC diretamente em redes blockchain, incluindo o XRP Ledger.\n\nAo contrário das stablecoins, que devem ser lastreadas 1:1 e são limitadas em escopo, a abordagem de Kidd utiliza o sistema bancário de reservas fracionárias.\n\n_\"Somos oito vezes mais eficientes em capital do que as stablecoins_\", disse ele. _\"E podemos pagar juros, oferecer proteção ao consumidor e manter o dinheiro circulando 24 horas por dia.\"_\n\nEste modelo *on-chain* atende desenvolvedores e usuários nativos de criptomoedas, ao mesmo tempo em que reduz as ineficiências do sistema legado.\n\nKidd enxerga um mundo onde pessoas em todos os lugares podem possuir e usar dólares americanos digitais que nunca deixam tecnicamente o sistema bancário, mesmo quando enviados através de fronteiras. Ele argumenta que, se os fundos permanecerem no ledger e na forma de dólar, as remessas tradicionais se tornam obsoletas.\n\nOpen Banking e Acesso Justo\n\nA conversa também abordou a evolução da regulamentação financeira dos EUA desde a eleição de 2024. Kidd creditou a nova administração por <a href=\"https://thecryptobasic.com/2025/03/08/us-federal-banking-regulator-clears-banks-to-engage-in-bitcoin-and-crypto-activities/\" rel=\"noopener\" target=\"_blank\">remover</a> o \"risco reputacional\" das diretrizes de exames federais. Este obstáculo havia anteriormente mantido muitas indústrias legais, incluindo criptomoedas, cannabis e conteúdo adulto, fora do sistema bancário.\n\n_\"Nós os chamamos de vícios consensuais_\", disse ele. _\"Se você é legal e licenciado, você deve ter acesso a serviços bancários. Ponto final.\"_\n\nEnquanto isso, o ativismo político de Kidd não diminuiu. Ele agora defende uma nova carta bancária focada exclusivamente em depósitos e pagamentos. Isso permitiria que empresas de fintech como a Ripple obtivessem licenças bancárias sem construir agências físicas ou emitir empréstimos.\n\nKidd almeja um futuro em que os serviços bancários sejam tão acessíveis e suaves quanto respirar ar.\n\n_\"Pagamentos devem ser gratuitos. Os serviços bancários devem ser universais. E a blockchain torna isso possível_\", disse ele. _\"O que a Ripple e outras estão fazendo agora é construindo esse futuro.\"_\n\nRipple para Acabar com o Sofrimento das Empresas Legadas\n\nÀ medida que a Ripple <a href=\"https://thecryptobasic.com/2025/05/14/no-xrp-as-ripple-to-use-rlusd-in-hidden-road-deal-for-300-financial-institutions/\" rel=\"noopener\" target=\"_blank\">expande seus investimentos</a> e navega pelos mercados globais após o processo judicial, Kidd prevê que a empresa desempenhará um papel central na reforma das finanças tradicionais.\n\nQuando perguntado onde ele vê a Ripple em dez anos, Kidd disse que a empresa se tornará uma empresa de blockchain totalmente integrada. Ele até sugeriu que a Ripple poderá um dia comprar algumas empresas legadas e \"pô-las para fora de sua miséria\".\n\nCom isso, ele quer dizer adquirir instituições financeiras que ainda operam com infraestrutura desatualizada e migrá-las para trilhos de blockchain mais eficientes.\n\nhttps://twitter.com/DigPerspectives/status/1933162109983977969\n\nSeus comentários destacam a ambição de longo prazo da Ripple não apenas de desafiar, mas de absorver e transformar a infraestrutura financeira legada.",
  "filename": "post_1749855662_ripple-pode-um-dia-comprar-empresas-tradicionais-e-acabar-com-seu-sofrimento-gre.json"
}