{
  "id": "https://thecryptobasic.com/?p=130608",
  "title": "Rich Dad Poor Dad Author Now Hopes Bitcoin Crashes: Here’s Why",
  "link": "https://thecryptobasic.com/2025/07/05/rich-dad-poor-dad-author-now-hopes-bitcoin-crashes-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=rich-dad-poor-dad-author-now-hopes-bitcoin-crashes-heres-why",
  "summary": "<b>Financial author Robert Kiyosaki has warned of attention-seeking “losers” who are increasingly speculating that Bitcoin will crash but hope it happens.</b>\n\nKiyosaki warned that these growing assertions are misleading and aim to sway speculators from reaping the rewards of buying Bitcoin. He shared these claims in a July 5 <a href=\"https://x.com/theRealKiyosaki/status/1941290425580650990\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a> as Bitcoin retraces slightly from its intra-week high o",
  "published": "Sat, 05 Jul 2025 09:16:33 +0000",
  "content": "<b>Financial author Robert Kiyosaki has warned of attention-seeking “losers” who are increasingly speculating that Bitcoin will crash but hope it happens.</b>\n\nKiyosaki warned that these growing assertions are misleading and aim to sway speculators from reaping the rewards of buying Bitcoin. He shared these claims in a July 5 <a href=\"https://x.com/theRealKiyosaki/status/1941290425580650990\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a> as Bitcoin retraces slightly from its intra-week high of $110,600.\nClickbait Losers Keep Speculating About a Bitcoin Crash\nWhile Bitcoin has shown resilience, speculations that a crash is on the horizon are making the rounds. Specifically, some believe that Bitcoin has reached its peak for the cycle and could undergo a significant correction in the near term.\n\nNonetheless, Kiyosaki insists these are exaggerated claims. He emphasized that those making these assertions are individuals and media outlets seeking attention through clickbait headlines.\n\nFurthermore, he noted that these speculations only frighten speculators or short-term investors. Notably, projections of a crash like this manipulate market sentiments, preventing retail from entering the market.\nKiyosaki Shares What He Will Do If  Bitcoin Crashes\nMeanwhile, if Bitcoin eventually crashes, Kiyosaki shared that he would buy more. His unperturbed disposition comes from a long-term bullish view of the pioneering cryptocurrency.\n\nIn fact, he stated that he hopes Bitcoin drops. According to him, the event would give him the opportunity to buy more BTC at a reduced price in anticipation of its rebound to unprecedented levels in the future.\n\nRemarkably, this highlights that Kiyosaki views Bitcoin as an asset with a bullish long-term trajectory, influencing his perspective beyond its short-term price action. This aligns with <a href=\"https://thecryptobasic.com/2025/05/30/michael-saylor-says-bitcoin-has-90-success-rate-in-5-years-and-99-in-30-40-years/\" rel=\"noopener\" target=\"_blank\">Michael Saylor’s </a>call that those who hold Bitcoin for at least five years have a significant chance of success.\n\nInterestingly, Kiyosaki is not waiting for a crash before he buys Bitcoin. He <a href=\"https://thecryptobasic.com/2025/07/01/ben-edited-robert-kiyosaki-buys-more-bitcoin-says-hed-rather-suck-than-be-a-loser-when-bitcoin-hits-1m/\" rel=\"noopener\" target=\"_blank\">revealed</a> earlier in the week that he bought more Bitcoin above $100,000. This is because he believes Bitcoin is undervalued at the current price and would reach $200,000 by the end of the year and $1 million in the next five years.\n\nMoreover, his recent tweet further spotlights his long-standing support for Bitcoin as a better alternative to saving in fiat currencies. The author believes that Bitcoin is the <a href=\"https://thecryptobasic.com/2025/03/24/rich-dad-poor-dad-author-robert-kiyosaki-says-bitcoin-is-the-biggest-opportunity-in-history/\" rel=\"noopener\" target=\"_blank\">biggest opportunity in history</a>, urging investors to acquire the premier cryptocurrency alongside gold and silver.",
  "title_pt": "Autor de Pai Rico, Pai Pobre agora torce por queda do Bitcoin: eis o porquê",
  "summary_pt": "O autor financeiro Robert Kiyosaki alertou sobre \"perdedores\" em busca de atenção que estão cada vez mais especulando sobre uma possível queda do Bitcoin, na esperança de que isso aconteça.\n\nKiyosaki alertou que essas afirmações crescentes são enganosas e visam afastar especuladores de colher os benefícios da compra de Bitcoin. Ele compartilhou essas alegações em um tweet de 5 de julho  (<a href=\"https://x.com/theRealKiyosaki/status/1941290425580650990\" rel=\"nofollow noopener\" target=\"_blank\">link</a>) enquanto o Bitcoin sofria uma pequena retração em relação à sua máxima intrasemanal.",
  "content_pt": "O autor financeiro Robert Kiyosaki alertou sobre \"perdedores\" em busca de atenção que estão cada vez mais especulando sobre uma queda do Bitcoin, mas na verdade *esperam* que isso aconteça.\n\nKiyosaki alertou que essas afirmações crescentes são enganosas e visam afastar os especuladores de colher os frutos da compra de Bitcoin. Ele compartilhou essas alegações em um tweet de 5 de julho  [link para o tweet]. Isso ocorreu enquanto o Bitcoin sofria uma leve retração após atingir sua máxima intrasemanal de US$ 110.600.\n\n**Perdedores de Clickbait Continuam Especulando sobre uma Queda do Bitcoin**\n\nEmbora o Bitcoin tenha demonstrado resiliência, especulações de que uma queda está próxima estão circulando. Especificamente, alguns acreditam que o Bitcoin atingiu seu pico para este ciclo e poderá sofrer uma correção significativa em breve.\n\nNo entanto, Kiyosaki insiste que essas são alegações exageradas. Ele enfatizou que aqueles que fazem essas afirmações são indivíduos e veículos de mídia em busca de atenção por meio de manchetes sensacionalistas (clickbait).\n\nAlém disso, ele observou que essas especulações apenas assustam especuladores ou investidores de curto prazo.  Projeções de uma queda como essa manipulam o sentimento do mercado, impedindo que investidores varejistas entrem no mercado.\n\n**Kiyosaki Compartilha o que Fará se o Bitcoin Cair**\n\nEnquanto isso, se o Bitcoin eventualmente cair, Kiyosaki disse que compraria mais. Sua disposição imperturbável vem de uma visão de longo prazo otimista (bullish) sobre a criptomoeda pioneira.\n\nNa verdade, ele afirmou que espera que o Bitcoin caia. Segundo ele, o evento lhe daria a oportunidade de comprar mais BTC a um preço reduzido, antecipando sua recuperação para níveis sem precedentes no futuro.\n\nIsso destaca que Kiyosaki vê o Bitcoin como um ativo com uma trajetória de longo prazo otimista, influenciando sua perspectiva além de sua ação de preço de curto prazo. Isso se alinha com a declaração de Michael Saylor de que aqueles que detêm Bitcoin por pelo menos cinco anos têm uma chance significativa de sucesso [link para a declaração de Michael Saylor].\n\nCuriosamente, Kiyosaki não está esperando uma queda antes de comprar Bitcoin. Ele revelou no início da semana que comprou mais Bitcoin acima de US$ 100.000. Isso porque ele acredita que o Bitcoin está subvalorizado ao preço atual e atingirá US$ 200.000 até o final do ano e US$ 1 milhão nos próximos cinco anos [link para a notícia sobre Kiyosaki comprando mais Bitcoin].\n\nAlém disso, seu recente tweet destaca ainda mais seu apoio de longa data ao Bitcoin como uma alternativa melhor do que guardar dinheiro em moedas fiduciárias. O autor acredita que o Bitcoin é a maior oportunidade da história [link para a declaração de Kiyosaki sobre o Bitcoin ser a maior oportunidade], incentivando os investidores a adquirir a principal criptomoeda junto com ouro e prata.",
  "filename": "post_1751824849_autor-de-pai-rico-pai-pobre-agora-torce-por-queda-do-bitcoin-eis-o-porque.json"
}