{
  "title": "Publicly Listed UK Gold Mining Firm to Convert Its Gold Revenue to Bitcoin for Reserve",
  "link": "https://thecryptobasic.com/2025/06/06/publicly-listed-uk-gold-mining-firm-to-convert-its-gold-revenue-to-bitcoin-for-reserve/?utm_source=rss&utm_medium=rss&utm_campaign=publicly-listed-uk-gold-mining-firm-to-convert-its-gold-revenue-to-bitcoin-for-reserve",
  "summary": "<strong>Bluebird, a UK-listed gold mining company, has announced plans to use the money it earns from gold to build Bitcoin reserves. </strong>\n\nThe company disclosed this in a brief release on X. However, Jonathan Morley-Kirk, the company's Non-executive Chairman, presented more details in a follow-up statement. \n\n<figure class=\"wp-caption alignnone\" style=\"width: 594px;\"><img alt=\"Bluebird on X\" height=\"563\" src=\"https://pbs.twimg.com/media/Gswq7HSWkAAvzIj?format=png&amp;name=small\" width=\"594",
  "content": "<strong>Bluebird, a UK-listed gold mining company, has announced plans to use the money it earns from gold to build Bitcoin reserves. </strong>\n\nThe company disclosed this in a brief release on X. However, Jonathan Morley-Kirk, the company's Non-executive Chairman, presented more details in a follow-up statement. \n\n<figure class=\"wp-caption alignnone\" style=\"width: 594px;\"><img alt=\"Bluebird on X\" height=\"563\" src=\"https://pbs.twimg.com/media/Gswq7HSWkAAvzIj?format=png&amp;name=small\" width=\"594\" /><figcaption class=\"wp-caption-text\">Bluebird on X</figcaption></figure>\nBluebird Eyeing a Bitcoin Strategy\nMorley-Kirk <a class=\"editor-rtfLink\" href=\"https://www.share-talk.com/bluebird-mining-ventures-ltd-lonbmv-strategic-update/\" rel=\"nofollow noopener\" target=\"_blank\">explained</a> that Bluebird, which runs gold projects across Asia, sees this as the right moment to rethink its approach.\n\nBluebird believes it makes sense to shift toward a strategy that includes both gold and Bitcoin. Morley-Kirk pointed out that gold has long served as a reliable store of value and remains an important asset for central banks and investors. \n\nHowever, he also stressed how Bitcoin's role in the financial scene keeps growing, especially as more people look for ways to protect their money from inflation, rising debt, and global uncertainty. \n\nBluebird sees Bitcoin not as a threat to gold but as a modern counterpart, and the company plans to convert future gold revenue into Bitcoin, treating it as digital gold.\nBitcoin Outperforms Gold\nNotably, Bitcoin has outperformed gold over the past decade, with proponents such as Strategy's Michael Saylor <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/01/27/microstrategy-bitcoin-buy-incoming-saylor-says-volatility-is-a-gift-to-the-faithful-amid-dip/\" rel=\"noopener\" target=\"_blank\">claiming</a> that its volatility makes it better. Recently, <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2025/06/05/bitcoin-boasts-53-1-expected-10-year-return-outshining-gold-and-us-treasury/\" rel=\"noopener\" target=\"_blank\">Bitwise projected</a> Bitcoin to grow 53.1% annually in the next decade, while it predicted gold to drop 3.6% within this period. \n\nBluebird will not just buy Bitcoin occasionally. Specifically, it wants to hold it as part of its balance sheet, using it as a treasury reserve. The company believes this strategy, paired with low overhead costs, sets it apart from other UK-listed mining firms. \n\nTo help lead the way, Bluebird is searching for a new CEO who understands digital assets and can help build this strategy from the ground up. \n\nAidan Bishop, the Executive Director and Interim CEO, supports this. He said he believes Bitcoin will reshape financial markets and help Bluebird attract a new kind of investor. \nMultiple Firms Now Joining the Bitcoin Strategy Campaign \nThis move puts Bluebird in line with a growing list of companies building Bitcoin into their financial playbooks. Just last month, DDC, an Asian food company, bought 21 Bitcoin and set a target of 500 BTC in six months and 5,000 BTC in three years. \n\nJust days back, SolarBank, a North American engineering firm, also adopted a Bitcoin treasury plan. While it hasn't shared details yet, the company confirmed that it sees Bitcoin as a major part of its financial future.\n\nThese firms follow in the footsteps of others who jumped into Bitcoin in 2024. KULR Technology Group <a class=\"editor-rtfLink\" href=\"https://thecryptobasic.com/2024/12/27/energy-firm-kurl-creates-bitcoin-reserve-with-initial-purchase-of-217-btc-worth-21m/\" rel=\"noopener\" target=\"_blank\">began buying Bitcoin</a> in December and committed to putting up to 90% of its extra cash into it. By the end of that month, it had already bought 217.18 BTC worth about $21 million. \n\nAcurx Pharmaceuticals, Hoth Therapeutics, and LQR House also approved plans to buy Bitcoin, each starting with at least $1 million.\n\nAccording to Bitcoin Treasuries, 225 entities now hold Bitcoin. Of those, 124 are public companies, which together own more than 816,000 BTC, worth over $85 billion. Private firms make up 34 of the holders. \n\nAltogether, these 225 entities control 3.4 million Bitcoin, accounting for more than 17% of the total coins in circulation. Strategy, Marathon Digital, Twenty One Capital, and Riot lead the pack as the biggest corporate holders.",
  "title_pt": "Mineradora Britânica de Ouro Listada na Bolsa Converterá Receita em Bitcoin para Reserva",
  "summary_pt": "A Bluebird, empresa de mineração de ouro listada no Reino Unido, anunciou planos de usar seus lucros com ouro para construir reservas de Bitcoin.\n\nA empresa divulgou isso em um breve comunicado no X (anteriormente Twitter). No entanto, Jonathan Morley-Kirk, presidente não-executivo da empresa, apresentou mais detalhes em uma declaração posterior.",
  "content_pt": "A Bluebird, empresa de mineração de ouro listada no Reino Unido, anunciou planos de usar seus lucros com ouro para construir reservas de Bitcoin.\n\nA companhia divulgou essa informação em um breve comunicado no X (anteriormente Twitter). No entanto, Jonathan Morley-Kirk, presidente não-executivo da empresa, apresentou mais detalhes em uma declaração posterior.\n\n[Imagem: captura de tela do post da Bluebird no X]\n\n**Bluebird visando uma estratégia com Bitcoin**\n\nMorley-Kirk explicou que a Bluebird, que opera projetos de ouro na Ásia, considera este o momento certo para repensar sua abordagem.\n\nA Bluebird acredita que faz sentido migrar para uma estratégia que inclua ouro e Bitcoin. Morley-Kirk apontou que o ouro há muito tempo serve como um depósito de valor confiável e permanece um ativo importante para bancos centrais e investidores.\n\nNo entanto, ele também enfatizou como o papel do Bitcoin na cena financeira continua crescendo, especialmente à medida que mais pessoas buscam maneiras de proteger seu dinheiro da inflação, aumento da dívida e incerteza global.\n\nA Bluebird vê o Bitcoin não como uma ameaça ao ouro, mas como uma contraparte moderna, e a empresa planeja converter sua receita futura de ouro em Bitcoin, tratando-o como \"ouro digital\".\n\n**Bitcoin supera o ouro**\n\nNotavelmente, o Bitcoin superou o ouro na última década, com proponentes como Michael Saylor da MicroStrategy afirmando que sua volatilidade o torna melhor. Recentemente, a Bitwise projetou um crescimento anual de 53,1% para o Bitcoin na próxima década, enquanto previu uma queda de 3,6% para o ouro nesse período.\n\nA Bluebird não comprará Bitcoin apenas ocasionalmente. Especificamente, ela deseja mantê-lo como parte de seu balanço patrimonial, usando-o como reserva de tesouraria. A empresa acredita que essa estratégia, aliada a baixos custos operacionais, a diferencia de outras empresas de mineração listadas no Reino Unido.\n\nPara ajudar a liderar o caminho, a Bluebird está procurando um novo CEO que entenda ativos digitais e possa ajudar a construir essa estratégia do zero.\n\nAidan Bishop, diretor executivo e CEO interino, apoia essa iniciativa. Ele disse acreditar que o Bitcoin remodelará os mercados financeiros e ajudará a Bluebird a atrair um novo tipo de investidor.\n\n**Várias empresas agora se juntam à campanha de estratégia Bitcoin**\n\nEssa ação coloca a Bluebird em linha com uma lista crescente de empresas que estão incorporando o Bitcoin em seus planos financeiros. No mês passado, a DDC, uma empresa asiática de alimentos, comprou 21 Bitcoins e estabeleceu uma meta de 500 BTC em seis meses e 5.000 BTC em três anos.\n\nHá poucos dias, a SolarBank, uma empresa de engenharia norte-americana, também adotou um plano de tesouraria em Bitcoin. Embora ainda não tenha compartilhado detalhes, a empresa confirmou que vê o Bitcoin como uma parte importante de seu futuro financeiro.\n\nEssas empresas seguem os passos de outras que aderiram ao Bitcoin em 2024. A KULR Technology Group começou a comprar Bitcoin em dezembro e se comprometeu a investir até 90% de seu caixa adicional nele. Até o final daquele mês, já havia comprado 217,18 BTC, no valor de aproximadamente US$ 21 milhões.\n\nA Acurx Pharmaceuticals, a Hoth Therapeutics e a LQR House também aprovaram planos para comprar Bitcoin, cada uma começando com pelo menos US$ 1 milhão.\n\nDe acordo com a Bitcoin Treasuries, 225 entidades detêm atualmente Bitcoin. Dessas, 124 são empresas públicas, que juntas possuem mais de 816.000 BTC, no valor de mais de US$ 85 bilhões. Empresas privadas representam 34 dos detentores.\n\nAo todo, essas 225 entidades controlam 3,4 milhões de Bitcoins, representando mais de 17% do total de moedas em circulação. MicroStrategy, Marathon Digital, Twenty One Capital e Riot lideram o grupo como as maiores detentoras corporativas."
}