{
  "title": "Sui Hovers at $3 Amid Rising Market Volatility: Will $2.71 Be Next?",
  "link": "https://thecryptobasic.com/2025/06/06/sui-hovers-at-3-amid-rising-market-volatility-will-2-71-be-next/?utm_source=rss&utm_medium=rss&utm_campaign=sui-hovers-at-3-amid-rising-market-volatility-will-2-71-be-next",
  "summary": "<strong>Sui price continues its downtrend after failing to break resistance at $4.20, with a potential drop to $2.71 as market volatility intensifies.</strong>\n\nAs Bitcoin tumbles below the $103,000 mark while momentarily reaching the $100,000 level, altcoins are in a free fall. <a href=\"https://thecryptobasic.com/2025/06/03/sui-struggles-below-3-45-is-a-drop-to-3-inevitable/\">Sui</a> momentarily breached below the $3 psychological level in a bearish pattern. Will the increasing market volatilit",
  "content": "<strong>Sui price continues its downtrend after failing to break resistance at $4.20, with a potential drop to $2.71 as market volatility intensifies.</strong>\n\nAs Bitcoin tumbles below the $103,000 mark while momentarily reaching the $100,000 level, altcoins are in a free fall. <a href=\"https://thecryptobasic.com/2025/06/03/sui-struggles-below-3-45-is-a-drop-to-3-inevitable/\">Sui</a> momentarily breached below the $3 psychological level in a bearish pattern. Will the increasing market volatility drop the SUI price to $2.71? \nSUI Price Analysis\nOn the 4-hour chart, SUI  continues a bearish trend after failing in its third attempt to overcome the $4.20 resistance. \n\n<figure class=\"wp-caption alignnone\" style=\"width: 3854px;\"><img alt=\"SUI Price Chart\" class=\"tv-snapshot-image\" height=\"2216\" src=\"https://s3.tradingview.com/snapshots/w/w8kyGJxr.png\" width=\"3854\" /><figcaption class=\"wp-caption-text\">SUI Price Chart</figcaption></figure>\n\nSince then, the SUI price has decreased by more than 25% over the past two weeks. The declining trend forms a falling channel pattern and has resulted in a death cross between the 50 and 200-period EMAs. \n\nWith the recent downfall, the 100 and 200 EMAs have also registered a negative crossover. During the pullback, the SUI price fell to $2.88 last night. However, the intraday recovery has pushed the current market price to $3.02, reclaiming the psychological level.\n\nAdditionally, it marks a positive comeback from the local support trend line. As the SUI price attempts to bounce back within the falling channel, the 4-hour RSI line shoots off from the oversold region, signaling a minor burst in bullish momentum, while the overall sentiment remains bearish. \n\nAs the broader market remains volatile, SUI could test the immediate support level at the 50% Fibonacci level at $2.71, as it remains the path of least resistance. However, a closing above the $3.00 resistance level could challenge the overhead resistance trend line near the $3.20 level.\nBearish Sentiment Surge in Derivatives Market\nAs the bearish trend in SUI intensifies, the derivatives data from Coinglass reveals that more than $11 million worth of bullish positions were wiped out in the past 24 hours. \n\nThe short liquidations remain at $693K, reflecting a massive exodus of SUI bulls. This has resulted in a steep pullback of 2.4% in the open interest down to $1.39 billion. \n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127647\" style=\"width: 2048px;\"><figure><img alt=\"SUI Derivatives\" class=\"size-full wp-image-127647\" height=\"430\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/Screenshot-2025-06-06-at-124223.png\" title=\"SUI Derivatives\" width=\"2048\" /><figcaption>SUI Derivatives</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127647\">SUI Derivatives</figcaption></figure>\n\nAdditionally, the increased long liquidations have dropped the long/short ratio to 0.8843 in the past 24 hours. Hence, the derivatives data reflects a complete bearish dominance, anticipating a steep correction in the altcoin.",
  "title_pt": "Sui em $3 com alta volatilidade: $2,71 será o próximo?",
  "summary_pt": "O preço do Sui continua sua tendência de queda após falhar em romper a resistência em US$ 4,20, com potencial queda para US$ 2,71 à medida que a volatilidade do mercado se intensifica.\n\nCom o Bitcoin caindo abaixo da marca de US$ 103.000, atingindo momentaneamente a marca de US$ 100.000, as altcoins estão em queda livre.  O Sui rompeu momentaneamente abaixo do nível psicológico de US$ 3 em um padrão de baixa. A crescente volatilidade do mercado...",
  "content_pt": "O preço do Sui continua sua tendência de baixa após falhar em romper a resistência em US$ 4,20, com uma possível queda para US$ 2,71 à medida que a volatilidade do mercado se intensifica.\n\nCom o Bitcoin caindo abaixo da marca de US$ 103.000, atingindo momentaneamente a marca de US$ 100.000, as altcoins estão em queda livre.  O Sui quebrou momentaneamente abaixo do nível psicológico de US$ 3 em um padrão de baixa. A crescente volatilidade do mercado fará com que o preço do SUI caia para US$ 2,71?\n\n**Análise de Preço do SUI**\n\nNo gráfico de 4 horas, o SUI continua uma tendência de baixa após falhar em sua terceira tentativa de superar a resistência de US$ 4,20.\n\n[Imagem do gráfico de preço do SUI]\n\nDesde então, o preço do SUI caiu mais de 25% nas últimas duas semanas. A tendência de queda forma um padrão de canal descendente e resultou em um \"death cross\" entre as EMAs de 50 e 200 períodos.\n\nCom a recente queda, as EMAs de 100 e 200 também registraram um cruzamento negativo. Durante o pullback, o preço do SUI caiu para US$ 2,88 na noite passada. No entanto, a recuperação intradiária elevou o preço de mercado atual para US$ 3,02, recuperando o nível psicológico.\n\nAlém disso, marca uma recuperação positiva da linha de tendência de suporte local.  À medida que o preço do SUI tenta se recuperar dentro do canal descendente, a linha RSI de 4 horas dispara da região de sobrevenda, sinalizando um pequeno aumento no momentum de alta, enquanto o sentimento geral permanece de baixa.\n\nComo o mercado mais amplo permanece volátil, o SUI pode testar o nível de suporte imediato no nível de Fibonacci de 50% em US$ 2,71, pois permanece o caminho de menor resistência. No entanto, um fechamento acima da resistência de US$ 3,00 poderia desafiar a linha de tendência de resistência superior próxima ao nível de US$ 3,20.\n\n**Aumento do Sentimento de Baixa no Mercado de Derivativos**\n\nÀ medida que a tendência de baixa no SUI se intensifica, os dados de derivativos da Coinglass revelam que mais de US$ 11 milhões em posições de alta foram eliminados nas últimas 24 horas.\n\nAs liquidações a descoberto permanecem em US$ 693 mil, refletindo um êxodo maciço de touros do SUI. Isso resultou em uma forte retração de 2,4% no open interest, para US$ 1,39 bilhão.\n\n[Imagem dos Derivativos do SUI]\n\nAlém disso, o aumento das liquidações longas reduziu a relação long/short para 0,8843 nas últimas 24 horas. Portanto, os dados de derivativos refletem uma completa dominância de baixa, antecipando uma forte correção na altcoin."
}