{
  "title": "Michael Saylor Says He’s More Bullish on $13M Bitcoin Price Forecast; Here’s Why",
  "link": "https://thecryptobasic.com/2025/06/06/michael-saylor-says-hes-more-bullish-on-13m-bitcoin-price-forecast-heres-why/?utm_source=rss&utm_medium=rss&utm_campaign=michael-saylor-says-hes-more-bullish-on-13m-bitcoin-price-forecast-heres-why",
  "summary": "<strong>Michael Saylor, the executive chairman of MicroStrategy (now Strategy), discloses that he is getting more bullish on his previous forecast that Bitcoin will hit $13 million by 2045.</strong> \n\nThe Strategy chairman expressed this view during a recent CNBC Squawk Box <a href=\"https://www.youtube.com/watch?v=7vkR2he4S-Y\" rel=\"nofollow noopener\" target=\"_blank\">interview</a>, where he provided a bullish outlook for Bitcoin. During the interview, Saylor recounted the previous <a href=\"https:",
  "content": "<strong>Michael Saylor, the executive chairman of MicroStrategy (now Strategy), discloses that he is getting more bullish on his previous forecast that Bitcoin will hit $13 million by 2045.</strong> \n\nThe Strategy chairman expressed this view during a recent CNBC Squawk Box <a href=\"https://www.youtube.com/watch?v=7vkR2he4S-Y\" rel=\"nofollow noopener\" target=\"_blank\">interview</a>, where he provided a bullish outlook for Bitcoin. During the interview, Saylor recounted the previous <a href=\"https://thecryptobasic.com/2024/12/18/heres-when-and-how-bitcoin-gets-to-13m-according-to-michael-saylor/\" rel=\"noopener\" target=\"_blank\">prediction</a> he laid out for BTC at the Bitcoin Conference in Nashville. \n\nAt the 2024 conference, Saylor predicted that Bitcoin would grow by 29% on average each year over the next 21 years. He suggested that factors such as Bitcoin education and rising institutional demand for the asset could propel BTC’s price to the $13 million target by 2045. \nBullish on $13M Bitcoin Price Forecast \nWhile his previous forecast triggered mixed reactions at the time, Saylor has once again backed the prediction. The Bitcoin evangelist emphasized that he is more bullish on the prediction due to the positive market developments over the past six months. \nRegulatory Clarity for BTC \nHe mentioned that the current U.S. administration now recognizes Bitcoin as a top digital commodity, providing regulatory clarity for the firstborn crypto. \nBanks Now Allowed to Hold Bitcoin \nAdditionally, he noted that the banking regulator has authorized banks in the United States to hold Bitcoin. Recall that in April, the Federal Reserve <a href=\"https://thecryptobasic.com/2025/04/25/federal-reserve-withdraws-95-of-its-anti-crypto-guidance-but-theres-still-one-major-obstacle-left/\" rel=\"noopener\" target=\"_blank\">withdrew</a> 95% of its anti-crypto rules. \n\nThese include the 2022 and 2023 supervisory letters, which required banks to notify the central bank before engaging in crypto-related activities. With the rules rescinded, banks can now engage freely in crypto activities without informing the Fed. \nGrowing Institutional Adoption \nFurthermore, Saylor indicated that there is strong institutional adoption for Bitcoin. According to him, more than 100 public companies currently hold Bitcoin on their balance sheets, with new firms adopting the asset every week. \n\nHe also highlighted the massive inflows into Bitcoin ETFs. As of press time, spot Bitcoin ETFs have accumulated $44.29 billion in net inflows and hold $122.98 billion in net assets.\nSupply Squeeze \nAccording to Saylor, another factor making him more bullish on the $13 million Bitcoin price forecast is the asset’s supply squeeze. He opined that only about 450 Bitcoins are made available for sale daily. The Strategy chairman noted that Bitcoin treasury companies and Bitcoin ETF issuers quickly buy these 450 BTC. \n\nBased on these positive developments, Saylor said he is more bullish on the possibility of Bitcoin reaching the $13 million target by 2045, 20 years from now. Interestingly, he raised his expected average annual return for Bitcoin from 29% to 40%, which suggests that BTC could reach the $13 million target sooner.  \n\nHitting the $13 million target demands a surge of 12,328% from the current price of $104,596.",
  "title_pt": "Saylor: Mais otimista que nunca sobre Bitcoin a US$ 13 milhões",
  "summary_pt": "Michael Saylor, presidente executivo da MicroStrategy (agora Strategy), declarou estar ainda mais otimista com sua previsão anterior de que o Bitcoin atingirá US$ 13 milhões até 2045.\n\nO presidente da Strategy expressou essa visão durante uma recente entrevista no programa CNBC Squawk Box [inserir link para entrevista], onde apresentou uma perspectiva otimista para o Bitcoin.  Durante a entrevista, Saylor reiterou sua previsão anterior [inserir link para previsão anterior, se disponível].",
  "content_pt": "Michael Saylor, presidente executivo da MicroStrategy (agora Strategy), declarou estar ainda mais otimista em sua previsão anterior de que o Bitcoin atingirá US$ 13 milhões até 2045.\n\nO presidente da Strategy expressou essa visão durante uma recente entrevista no programa CNBC Squawk Box [link para a entrevista], onde apresentou uma perspectiva otimista para o Bitcoin. Durante a entrevista, Saylor relembrou a previsão anterior [link para a previsão] que fez na Bitcoin Conference em Nashville.\n\nNa conferência de 2024, Saylor previu que o Bitcoin cresceria 29% em média a cada ano nos próximos 21 anos. Ele sugeriu que fatores como a educação sobre Bitcoin e o aumento da demanda institucional pelo ativo poderiam impulsionar o preço do BTC para a meta de US$ 13 milhões até 2045.\n\n**Otimismo com a Previsão de Preço de US$ 13 Milhões para o Bitcoin**\n\nEmbora sua previsão anterior tenha gerado reações mistas na época, Saylor mais uma vez a respaldou. O evangelista do Bitcoin enfatizou que está ainda mais otimista com a previsão devido aos desenvolvimentos positivos do mercado nos últimos seis meses.\n\n**Clareza Regulatória para o BTC**\n\nEle mencionou que a atual administração dos EUA agora reconhece o Bitcoin como uma commodity digital de primeira linha, proporcionando clareza regulatória para a criptomoeda pioneira.\n\n**Bancos Agora Autorizados a Manter Bitcoin**\n\nAlém disso, ele observou que o regulador bancário autorizou bancos nos Estados Unidos a manter Bitcoin. Lembre-se que em abril, o Federal Reserve [link para a notícia] retirou 95% de suas regras anti-cripto.\n\nIsso inclui as cartas de supervisão de 2022 e 2023, que exigiam que os bancos notificassem o banco central antes de se envolverem em atividades relacionadas a criptomoedas. Com as regras revogadas, os bancos agora podem se envolver livremente em atividades com criptomoedas sem informar o Fed.\n\n**Adoção Institucional Crescente**\n\nAlém disso, Saylor indicou que há uma forte adoção institucional do Bitcoin. Segundo ele, mais de 100 empresas públicas atualmente detêm Bitcoin em seus balanços patrimoniais, com novas empresas adotando o ativo a cada semana.\n\nEle também destacou os grandes influxos de capital em ETFs de Bitcoin. No momento da publicação, os ETFs de Bitcoin à vista acumularam US$ 44,29 bilhões em entradas líquidas e detêm US$ 122,98 bilhões em ativos líquidos.\n\n**Escassez de Oferta**\n\nDe acordo com Saylor, outro fator que o torna mais otimista com a previsão de preço de US$ 13 milhões para o Bitcoin é a escassez de oferta do ativo. Ele opinou que apenas cerca de 450 Bitcoins são disponibilizados para venda diariamente. O presidente da Strategy observou que empresas de tesouraria de Bitcoin e emissores de ETFs de Bitcoin compram rapidamente esses 450 BTCs.\n\nCom base nesses desenvolvimentos positivos, Saylor disse que está mais otimista com a possibilidade do Bitcoin atingir a meta de US$ 13 milhões até 2045, 20 anos a partir de agora. Curiosamente, ele elevou seu retorno anual médio esperado para o Bitcoin de 29% para 40%, o que sugere que o BTC poderia atingir a meta de US$ 13 milhões antes.\n\nAlcançar a meta de US$ 13 milhões exige um aumento de 12.328% em relação ao preço atual de US$ 104.596."
}