{
  "title": "Trump Media Registers $12 Billion in New Securities Amid Bitcoin Acquisition Plans",
  "link": "https://thecryptobasic.com/2025/06/06/trump-media-registers-12-billion-in-new-securities-amid-bitcoin-acquisition-plans/?utm_source=rss&utm_medium=rss&utm_campaign=trump-media-registers-12-billion-in-new-securities-amid-bitcoin-acquisition-plans",
  "summary": "<b>Trump Media and Technology Group, the parent company of Truth Social, has filed to register up to $12 billion in new securities following Bitcoin acquisition plans. </b>\n\nThis move, disclosed in a recent S-3 filing, marks another significant step for the company, which recently concluded a $2.3 billion Bitcoin treasury deal. \n\nThe <a href=\"https://www.sec.gov/Archives/edgar/data/1849635/000114036125021579/ny20050075x1_s3.htm\" rel=\"nofollow noopener\" target=\"_blank\">filing</a> reveals plans to",
  "content": "<b>Trump Media and Technology Group, the parent company of Truth Social, has filed to register up to $12 billion in new securities following Bitcoin acquisition plans. </b>\n\nThis move, disclosed in a recent S-3 filing, marks another significant step for the company, which recently concluded a $2.3 billion Bitcoin treasury deal. \n\nThe <a href=\"https://www.sec.gov/Archives/edgar/data/1849635/000114036125021579/ny20050075x1_s3.htm\" rel=\"nofollow noopener\" target=\"_blank\">filing</a> reveals plans to issue up to 84.6 million shares of common stock. However, the offering will not take effect until the SEC grants approval.\nBitcoin Treasury Deal and Future Acquisitions\nTrump Media’s decision to file for additional securities follows its recent involvement in acquiring Bitcoin. Last week, the company announced a Bitcoin treasury deal valued at $2.3 billion. This move aims to strengthen Trump Media’s capital position, as well as support its future expansion. \n\nNotably, the company had previously denied reports suggesting it would raise a larger $3 billion fund for Bitcoin investments. Despite this, the current filing indicates the company’s intention to continue acquiring the cryptocurrency. With this, it positions itself alongside other firms like <a href=\"https://thecryptobasic.com/2025/05/26/saylor-says-buy-bitcoin-with-money-you-cant-afford-to-lose-as-strategy-buys-another-4020-btc/\" rel=\"noopener\" target=\"_blank\">Strategy</a>, which have adopted similar Bitcoin acquisition strategies.\n\nMeanwhile, Trump Media’s growing interest in Bitcoin signals a broader trend among companies exploring ways to integrate the digital currency into their portfolios. Companies such as Marathon Digital and Metaplanet have also engaged in Bitcoin acquisitions.\n\n\nInterestingly, new entrants have emerged. Specifically, KULR Technology entered the scene in December 2024 with $21 million worth of Bitcoin. Acurx Pharmaceuticals and Hoth Therapeutics also announced plans to acquire BTC this year. In addition, gold mining firm Bluebird recently <a href=\"https://thecryptobasic.com/2025/06/06/publicly-listed-uk-gold-mining-firm-to-convert-its-gold-revenue-to-bitcoin-for-reserve/\" rel=\"noopener\" target=\"_blank\">became</a> the latest entrant.\nExpansion Plans and Capital Markets Access\nDevin Nunes, the CEO and President of Trump Media, <a href=\"https://www.morningstar.com/news/globe-newswire/9464338/trump-media-files-s-3-registration-statement-for-previously-announced-bitcoin-treasury-deal\" rel=\"nofollow noopener\" target=\"_blank\">emphasized</a> the company's focus on securing capital for rapid growth. He mentioned that the capital raised through these initiatives would provide the flexibility needed to acquire valuable assets and increase the company's customer base. \n\nThis, in turn, is expected to enable Trump Media to tap into capital markets when most advantageous. Nunes highlighted that the company's goal is to ensure financial independence while accelerating its growth trajectory, which is increasingly dependent on acquiring digital assets like Bitcoin.\n\nFurthermore, Trump Media's involvement in crypto extends beyond just holding Bitcoin. The company is also exploring the <a href=\"https://www.wrbl.com/business/press-releases/globenewswire/9463908/trump-media-files-registration-statement-for-bitcoin-etf/\" rel=\"nofollow noopener\" target=\"_blank\">launch</a> of a Bitcoin exchange-traded fund, which could expand its presence in the crypto market. This is in line with other companies offering similar financial products related to Bitcoin.",
  "title_pt": "Trump Media Registra US$ 12 Bilhões em Novos Títulos em Meio a Planos de Aquisição de Bitcoin",
  "summary_pt": "O Trump Media and Technology Group (TMTG), empresa controladora do Truth Social, protocolou o registro de até US$ 12 bilhões em novos valores mobiliários após planos de aquisição de Bitcoin.\n\nEssa movimentação, divulgada em um recente pedido S-3, representa mais um passo significativo para a empresa, que recentemente concluiu um acordo de tesouraria de Bitcoin no valor de US$ 2,3 bilhões.\n\nO [link para o documento S-3] revela planos para...",
  "content_pt": "O Trump Media and Technology Group (TMG), empresa-mãe do Truth Social, protocolou o registro de até US$ 12 bilhões em novos títulos, após planos de aquisição de Bitcoin.\n\nEssa movimentação, divulgada em um recente pedido S-3, representa mais um passo significativo para a empresa, que recentemente concluiu um acordo de tesouraria de Bitcoin no valor de US$ 2,3 bilhões.  O [pedido](https://www.sec.gov/Archives/edgar/data/1849635/000114036125021579/ny20050075x1_s3.htm) revela planos de emitir até 84,6 milhões de ações ordinárias.  No entanto, a oferta só entrará em vigor após a aprovação da SEC.\n\n**Acordo de Tesouraria em Bitcoin e Aquisições Futuras**\n\nA decisão da Trump Media de solicitar títulos adicionais segue seu recente envolvimento na aquisição de Bitcoin. Na semana passada, a empresa anunciou um acordo de tesouraria em Bitcoin avaliado em US$ 2,3 bilhões.  Essa medida visa fortalecer a posição de capital da Trump Media, bem como apoiar sua expansão futura.\n\nÉ importante notar que a empresa havia anteriormente negado relatos que sugeriam que arrecadaria um fundo maior de US$ 3 bilhões para investimentos em Bitcoin. Apesar disso, o pedido atual indica a intenção da empresa de continuar adquirindo a criptomoeda, posicionando-se ao lado de outras empresas como a [Strategy](https://thecryptobasic.com/2025/05/26/saylor-says-buy-bitcoin-with-money-you-cant-afford-to-lose-as-strategy-buys-another-4020-btc/), que adotaram estratégias semelhantes de aquisição de Bitcoin.\n\nEnquanto isso, o crescente interesse da Trump Media em Bitcoin sinaliza uma tendência mais ampla entre empresas que exploram maneiras de integrar a moeda digital em seus portfólios. Empresas como Marathon Digital e Metaplanet também realizaram aquisições de Bitcoin.\n\nCuriosamente, novos entrantes surgiram. Especificamente, a KULR Technology entrou em cena em dezembro de 2024 com US$ 21 milhões em Bitcoin. A Acurx Pharmaceuticals e a Hoth Therapeutics também anunciaram planos de adquirir BTC este ano. Além disso, a empresa de mineração de ouro Bluebird recentemente [se tornou](https://thecryptobasic.com/2025/06/06/publicly-listed-uk-gold-mining-firm-to-convert-its-gold-revenue-to-bitcoin-for-reserve/) a mais recente participante.\n\n**Planos de Expansão e Acesso aos Mercados de Capitais**\n\nDevin Nunes, CEO e Presidente da Trump Media, [enfatizou](https://www.morningstar.com/news/globe-newswire/9464338/trump-media-files-s-3-registration-statement-for-previously-announced-bitcoin-treasury-deal) o foco da empresa em garantir capital para crescimento rápido. Ele mencionou que o capital levantado por meio dessas iniciativas proporcionaria a flexibilidade necessária para adquirir ativos valiosos e aumentar a base de clientes da empresa.\n\nIsso, por sua vez, deve permitir que a Trump Media acesse os mercados de capitais quando for mais vantajoso. Nunes destacou que o objetivo da empresa é garantir a independência financeira enquanto acelera sua trajetória de crescimento, que depende cada vez mais da aquisição de ativos digitais como o Bitcoin.\n\nAlém disso, o envolvimento da Trump Media em criptomoedas vai além de apenas deter Bitcoin. A empresa também está explorando o [lançamento](https://www.wrbl.com/business/press-releases/globenewswire/9463908/trump-media-files-registration-statement-for-bitcoin-etf/) de um fundo de investimento negociado em bolsa (ETF) de Bitcoin, o que poderia expandir sua presença no mercado de criptomoedas. Isso está em linha com outras empresas que oferecem produtos financeiros semelhantes relacionados ao Bitcoin."
}