{
  "id": "https://thecryptobasic.com/?p=127960",
  "title": "BlackRock Says Institutions Bitcoin Adoption is Still Very Early",
  "link": "https://thecryptobasic.com/2025/06/10/blackrock-says-institutions-bitcoin-adoption-is-still-very-early/?utm_source=rss&utm_medium=rss&utm_campaign=blackrock-says-institutions-bitcoin-adoption-is-still-very-early",
  "summary": "<b>Asset manager BlackRock has highlighted a growing interest among institutions and wealth advisors in Bitcoin but insisted it is still in its early stages.</b>\n\nRobert Mitchnick, the head of digital assets at the $11.5 trillion asset management firm, said in the Bloomberg ETF IQ <a href=\"https://www.bloomberg.com/news/videos/2025-06-09/blackrock-s-mitchnick-on-the-outperformace-of-ibit-video\" rel=\"nofollow noopener\" target=\"_blank\">interview</a> that wealth advisors are now turning towards Bit",
  "published": "Tue, 10 Jun 2025 08:12:11 +0000",
  "content": "<b>Asset manager BlackRock has highlighted a growing interest among institutions and wealth advisors in Bitcoin but insisted it is still in its early stages.</b>\n\nRobert Mitchnick, the head of digital assets at the $11.5 trillion asset management firm, said in the Bloomberg ETF IQ <a href=\"https://www.bloomberg.com/news/videos/2025-06-09/blackrock-s-mitchnick-on-the-outperformace-of-ibit-video\" rel=\"nofollow noopener\" target=\"_blank\">interview</a> that wealth advisors are now turning towards Bitcoin. And while this is a positive development, he emphasized that it is still in the early stages, and more institutions will come around soon.\n\nHis comments came as the BlackRock iShares Bitcoin Trust (IBIT) nears an impressive $72 billion in net assets. The Bitcoin investment fund experienced pent-up demand between April and May. In May alone, the product attracted a net inflow of $5.91 billion, marking its strongest month since March 2024.\n\n<figure class=\"wp-caption alignnone\" id=\"attachment_127973\" style=\"width: 1766px;\"><figure><img alt=\"BlackRock Bitcoin ETF May 2025 Netflow Sosovalue\" class=\"size-full wp-image-127973\" height=\"646\" src=\"https://thecryptobasic.com/wp-content/uploads/2025/06/BlackRock-Bitcoin-ETF-May-2025-Netflow-Sosovalue.png\" title=\"BlackRock Bitcoin ETF May 2025 Netflow Sosovalue\" width=\"1766\" /><figcaption>BlackRock Bitcoin ETF May 2025 Netflow Sosovalue</figcaption></figure><figcaption class=\"wp-caption-text\" id=\"caption-attachment-127973\">BlackRock Bitcoin ETF May 2025 Netflow | Sosovalue</figcaption></figure>\nWealth Advisors Are Coming\nRecent 13-F filings with the US SEC for Q1 2025 saw growing exposure from wealth advisors towards Bitcoin spot ETFs. For instance, Goldman Sachs increased its exposure, while new names, such as the Abu Dhabi sovereign wealth fund, <a href=\"https://thecryptobasic.com/2025/05/16/abu-dhabi-bought-more-bitcoin-through-blackrocks-ibit-in-q1-2024/\" rel=\"noopener\" target=\"_blank\">Mubadala</a>, also bought more Bitcoin.\n\nBlackRock’s Mitchnick acknowledged the growing adoption of the Bitcoin ETF wrapper for new and experienced institutions. However, he stressed that it is very early in terms of wealth advisor adoption.\n\nThe approval process for new ETFs takes time, as institutions conduct thorough due diligence on the nature and viability of the fund. Nonetheless, he identified a strong interest among some of the “largest firms,” so much so that some of them are lowering their barriers and approving that their advisors buy <a href=\"https://thecryptobasic.com/tag/bitcoin/\" rel=\"noopener\" target=\"_blank\">Bitcoin</a>.\nPossible Drivers for Bitcoin ETFs Surge\nNonetheless, the IBIT has been one of the most <a href=\"https://thecryptobasic.com/2024/12/05/blackrocks-bitcoin-etf-becomes-most-successful-etf-ever-after-50b-milestone/\">successful launches</a> in the history of ETFs. The Bitcoin investment product became the fastest to reach a net asset under management of $50 billion and is now well above $71 billion.\n\nWhen asked the possible drivers for this stunning growth, Mitchnick highlighted a congregation of several bullish catalysts. He stated that pent-up demand for the vehicles, which tracks Bitcoin’s performance, initially started with retail investors.\n\nSoon enough, high-net-worth individuals began gaining exposure. Recall that several billionaires, including <a href=\"https://thecryptobasic.com/2025/03/04/mexican-billionaire-salinas-commits-70-of-his-wealth-to-bitcoin/\" rel=\"noopener\" target=\"_blank\">Ricardo Salinas Pliego</a>, have staggering amounts of their portfolio in Bitcoin and Bitcoin-related products. Meanwhile, it remains unclear if the Mexican billionaire holds IBIT shares.\n\nNow, Mitchnick has revealed steady progress in institutional adoption. According to him, the massive demand has fueled these incessant inflows into the funds.\nBitcoin is Volatile Yet Appealing\nMeanwhile, Mitchnick acknowledged a reduction in Bitcoin’s volatility. While stating that Bitcoin, on a standalone basis, is a volatile asset, citing its relatively novel technology, he noted that the asset offers a unique appeal to investors. \n\n<em>“It is still volatile, but at the same time, its risk and return drivers are markedly different from most of the rest of the assets in a traditional portfolio, and that’s important,”</em> Mitchnick emphasized.\n\nFor the uninitiated, Bitcoin is one of the best-performing assets of the last decade, demonstrating a level of consistency in rewarding its adopters. The pioneering cryptocurrency rallied 121% last year and is up 15% year-to-date.\n\nAt the time of writing, it trades at $109,608, representing a 3.78% increase in the past 24 hours.\n\nNotably, Mitchnick also discussed BlackRock's Ethereum spot ETF, which he disclosed is currently strongly driven by retail investor attraction. He noted that, although there is an exciting story surrounding Ethereum, as seen with Bitcoin, it focuses more on technological innovation and blockchain adoption.",
  "title_pt": "BlackRock: Adoção de Bitcoin por instituições ainda está no início",
  "summary_pt": "A gestora de ativos BlackRock destacou o crescente interesse de instituições e assessores de patrimônio em Bitcoin, mas insistiu que a tecnologia ainda está em seus estágios iniciais.\n\nRobert Mitchnick, chefe de ativos digitais da empresa de gestão de ativos de US$ 11,5 trilhões, disse em entrevista ao Bloomberg ETF IQ  [link para a entrevista] que os assessores de patrimônio estão agora se voltando para o Bitcoin.",
  "content_pt": "A gestora de ativos BlackRock destacou o crescente interesse de instituições e assessores de patrimônio em Bitcoin, mas insistiu que a adoção ainda está em estágio inicial.\n\nRobert Mitchnick, chefe de ativos digitais da empresa de gestão de ativos de US$ 11,5 trilhões, afirmou em entrevista ao Bloomberg ETF IQ [link para a entrevista] que assessores de patrimônio estão se voltando para o Bitcoin. Embora isso seja um desenvolvimento positivo, ele enfatizou que ainda se trata de um estágio inicial e que mais instituições adotarão a criptomoeda em breve.\n\nSeus comentários surgiram com o BlackRock iShares Bitcoin Trust (IBIT) se aproximando de impressionantes US$ 72 bilhões em ativos líquidos. O fundo de investimento em Bitcoin experimentou demanda reprimida entre abril e maio. Somente em maio, o produto atraiu um influxo líquido de US$ 5,91 bilhões, marcando seu mês mais forte desde março de 2024.\n\n[Imagem: BlackRock Bitcoin ETF May 2025 Netflow | Sosovalue]\n\n**Assessores de Patrimônio Estão Chegando**\n\nAs recentes declarações 13-F (Form 13F) apresentadas à SEC dos EUA para o primeiro trimestre de 2025 mostraram uma exposição crescente de assessores de patrimônio a ETFs de Bitcoin à vista. Por exemplo, o Goldman Sachs aumentou sua exposição, enquanto novos nomes, como o fundo soberano de Abu Dhabi, Mubadala [link para artigo sobre Mubadala], também compraram mais Bitcoin.\n\nMitchnick, da BlackRock, reconheceu a crescente adoção do wrapper de ETF de Bitcoin por instituições novas e experientes. No entanto, ele enfatizou que a adoção por assessores de patrimônio está em estágio muito inicial.\n\nO processo de aprovação de novos ETFs leva tempo, pois as instituições realizam uma análise de risco completa (due diligence) sobre a natureza e viabilidade do fundo.  Apesar disso, ele identificou um forte interesse entre algumas das \"maiores empresas\", a ponto de algumas delas estarem reduzindo suas barreiras e aprovando que seus assessores comprem Bitcoin [link para artigo sobre Bitcoin].\n\n**Possíveis Impulsionadores da Alta dos ETFs de Bitcoin**\n\nApesar disso, o IBIT tem sido um dos lançamentos mais bem-sucedidos [link para artigo sobre o sucesso do IBIT] na história dos ETFs. O produto de investimento em Bitcoin foi o mais rápido a atingir US$ 50 bilhões em ativos líquidos sob gestão e agora está bem acima de US$ 71 bilhões.\n\nQuando questionado sobre os possíveis impulsionadores desse crescimento impressionante, Mitchnick destacou uma confluência de diversos catalisadores otimistas. Ele afirmou que a demanda reprimida pelos veículos, que acompanham o desempenho do Bitcoin, começou inicialmente com investidores pessoa física (retail investors).\n\nEm pouco tempo, indivíduos de alto patrimônio líquido começaram a se expor ao ativo. Lembre-se de que vários bilionários, incluindo Ricardo Salinas Pliego [link para artigo sobre Salinas Pliego], têm quantias impressionantes de seu portfólio em Bitcoin e produtos relacionados ao Bitcoin.  Entretanto, ainda não está claro se o bilionário mexicano detém ações do IBIT.\n\nAgora, Mitchnick revelou um progresso constante na adoção institucional. De acordo com ele, a demanda maciça alimentou esses influxos incessantes nos fundos.\n\n**Bitcoin é Volátil, Mas Atraente**\n\nEnquanto isso, Mitchnick reconheceu uma redução na volatilidade do Bitcoin. Embora afirmasse que o Bitcoin, isoladamente, é um ativo volátil, citando sua tecnologia relativamente nova, ele observou que o ativo oferece um apelo único aos investidores.\n\n“Ainda é volátil, mas ao mesmo tempo, seus fatores de risco e retorno são marcadamente diferentes da maioria dos demais ativos em uma carteira tradicional, e isso é importante”, enfatizou Mitchnick.\n\nPara quem não está familiarizado, o Bitcoin é um dos ativos de melhor desempenho da última década, demonstrando um nível de consistência em recompensar seus adotantes. A criptomoeda pioneira teve uma alta de 121% no ano passado e está com alta de 15% no ano até o momento.\n\nNo momento da redação, é negociado a US$ 109.608, representando um aumento de 3,78% nas últimas 24 horas.\n\nNotavelmente, Mitchnick também discutiu o ETF de Ethereum à vista da BlackRock, que, segundo ele, é atualmente impulsionado fortemente pela atração de investidores pessoa física. Ele observou que, embora haja uma história empolgante em torno do Ethereum, como visto com o Bitcoin, ele se concentra mais em inovação tecnológica e adoção de blockchain.",
  "filename": "post_1749561209_blackrock-adocao-de-bitcoin-por-instituicoes-ainda-esta-no-inicio.json"
}