{
  "id": "https://thecryptobasic.com/?p=127976",
  "title": "XRP is The Covid of Finance: Gary Cardone",
  "link": "https://thecryptobasic.com/2025/06/10/xrp-is-the-covid-of-finance-gary-cardone/?utm_source=rss&utm_medium=rss&utm_campaign=xrp-is-the-covid-of-finance-gary-cardone",
  "summary": "<strong>Financial expert Gary Cardone has slammed XRP for its alleged alignment with global authoritarianism amid speculation about the digital euro integration with the XRPL.</strong>\n\nIn recent weeks, there have been talks about the European Central Bank (ECB) potentially launching its upcoming <a href=\"https://thecryptobasic.com/2025/03/20/europe-must-adopt-digital-euro-to-counter-stablecoin-threats-and-us-payment-dominance-says-ecb-chief-economist/\" rel=\"noopener\" target=\"_blank\">digital eur",
  "published": "Tue, 10 Jun 2025 08:09:51 +0000",
  "content": "<strong>Financial expert Gary Cardone has slammed XRP for its alleged alignment with global authoritarianism amid speculation about the digital euro integration with the XRPL.</strong>\n\nIn recent weeks, there have been talks about the European Central Bank (ECB) potentially launching its upcoming <a href=\"https://thecryptobasic.com/2025/03/20/europe-must-adopt-digital-euro-to-counter-stablecoin-threats-and-us-payment-dominance-says-ecb-chief-economist/\" rel=\"noopener\" target=\"_blank\">digital euro</a> on the XRP Ledger. Although there is no official confirmation, such claims have gained attention among both XRP supporters and critics.\nCardone: XRP Will Partner With “Oppressive People to Survive”\nIn a <a href=\"https://x.com/GaryCardone/status/1932111975380648306\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, Gary Cardone criticized XRP, stating it “will take any path it needs to survive,” even if that means aligning itself with some of the world’s most oppressive figures.\n\nHe took direct aim at ECB President Christine Lagarde, mockingly referring to her as “Ms. Cringe,” and accused her of wanting to turn Europe into a “prison continent.”\n\nFurthermore, Cardone equated XRP to a second wave of COVID-19, calling it “COVID-19 Part Two in finance.”\n\nHe also warned that continued support for XRP is akin to voting for “European warmongers.”\n\nEssentially, Cardone’s remarks highlight an ideological divide within the crypto community. Some view XRP’s potential alignment with central banks and financial institutions as a strategic advantage. Others see it as a betrayal of crypto’s foundational values.\n\nFor context, many in the crypto industry oppose central bank digital currencies (CBDCs). They view them as tools for surveillance and as fundamentally at odds with crypto's decentralization ethos.\n\nDespite the criticism, announcements of government-level blockchain adoption often spark admiration and excitement among network supporters, who overlook concerns in favor of broader adoption.\n\nAs a result, the rumored involvement of the <a href=\"https://thecryptobasic.com/2025/06/05/ripple-cto-says-xrp-ledger-is-more-than-just-xrp/\" rel=\"noopener\" target=\"_blank\">XRP Ledger</a> in the digital euro initiative has triggered excitement among community members, even as critics like Cardone raise red flags.\nXRP Army Reacts, Sets the Record Straight\nMeanwhile, XRP community members have resisted Cardone’s claims, calling them exaggerated and factually incorrect. Robert Doyle, known online as Crypto Sensei, clarified that there is no official confirmation regarding the technology selected for the digital euro.\n\nThe European Central Bank has stated it is prepared to launch a central bank digital currency if approved by the European Parliament. However, it has not decided on the specific technology to use.\n\nDoyle also pointed out that Ripple has engaged in discussions on CBDC with several central banks globally. Countries such as Georgia and Palau have already <a href=\"https://thecryptobasic.com/2023/11/03/out-of-9-companies-georgia-selects-ripple-for-its-national-digital-currency/\" rel=\"noopener\" target=\"_blank\">chosen Ripple’s technology for pilot programs.</a>\n\nAt present, there is no public evidence that Ripple or the XRP Ledger has been selected for the ECB’s digital euro initiative.\n\nAnother prominent community figure, Moon Lambo, responded that Cardone is either gullible, has fallen for fake news, or is intentionally spreading misinformation.\n\nHe linked to the official ECB website, noting that the central bank has not made any platform decisions, and hasn’t even confirmed whether a digital euro will be launched.\n\nMoon Lambo claimed that Cardone suffers from “XRP Derangement Syndrome,” suggesting that Cardone wants the story to be true because it reinforces his tribal narrative. He urged Cardone to act with integrity, warning that posts like his erode trust rather than build credibility.\n<p>Meanwhile, in his remarks, attorney Bill Morgan highlighted the irony of the claim that XRP Ledger, a public, permissionless network, could be cooperating with some of the most oppressive people on Earth just to survive.</p>\nhttps://twitter.com/Belisarius2020/status/1932273710335201597",
  "title_pt": "XRP: A Covid das Finanças - Gary Cardone",
  "summary_pt": "O especialista financeiro Gary Cardone criticou o XRP por sua suposta alinhamento com o autoritarismo global, em meio a especulações sobre a integração do euro digital com o XRPL (Ripple Ledger Protocol).\n\nNas últimas semanas, houve discussões sobre o Banco Central Europeu (BCE) potencialmente lançando seu futuro euro digital.",
  "content_pt": "O especialista financeiro Gary Cardone criticou severamente o XRP, alegando sua suposta alinhamento com o autoritarismo global em meio a especulações sobre a integração do euro digital com o XRPL.\n\nNas últimas semanas, houve discussões sobre o Banco Central Europeu (BCE) possivelmente lançando seu <a href=\"https://thecryptobasic.com/2025/03/20/europe-must-adopt-digital-euro-to-counter-stablecoin-threats-and-us-payment-dominance-says-ecb-chief-economist/\" rel=\"noopener\" target=\"_blank\">euro digital</a> no XRP Ledger. Embora não haja confirmação oficial, tais alegações chamaram a atenção de apoiadores e críticos do XRP.\n\nCardone: XRP se aliará a \"pessoas opressoras para sobreviver\"\n\nEm um <a href=\"https://x.com/GaryCardone/status/1932111975380648306\" rel=\"nofollow noopener\" target=\"_blank\">tweet</a>, Gary Cardone criticou o XRP, afirmando que \"tomará qualquer caminho necessário para sobreviver\", mesmo que isso signifique se alinhar com algumas das figuras mais opressoras do mundo.\n\nEle atacou diretamente a presidente do BCE, Christine Lagarde, referindo-se a ela ironicamente como \"Srta. Cringe\", e a acusou de querer transformar a Europa em um \"continente prisão\".\n\nAlém disso, Cardone comparou o XRP a uma segunda onda de COVID-19, chamando-o de \"COVID-19 Parte Dois nas finanças\".\n\nEle também alertou que o apoio contínuo ao XRP é semelhante a votar em \"belicistas europeus\".\n\nEssencialmente, os comentários de Cardone destacam uma divisão ideológica dentro da comunidade cripto. Alguns veem o potencial alinhamento do XRP com bancos centrais e instituições financeiras como uma vantagem estratégica. Outros veem isso como uma traição aos valores fundamentais da criptomoeda.\n\nPara contextualizar, muitos na indústria de criptomoedas se opõem às moedas digitais de banco central (CBDCs). Eles as veem como ferramentas de vigilância e fundamentalmente em desacordo com a ética de descentralização da criptomoeda.\n\nApesar das críticas, os anúncios de adoção de blockchain em nível governamental frequentemente geram admiração e entusiasmo entre os apoiadores da rede, que ignoram as preocupações em favor de uma adoção mais ampla.\n\nComo resultado, o envolvimento rumoreado do <a href=\"https://thecryptobasic.com/2025/06/05/ripple-cto-says-xrp-ledger-is-more-than-just-xrp/\" rel=\"noopener\" target=\"_blank\">XRP Ledger</a> na iniciativa do euro digital provocou entusiasmo entre os membros da comunidade, mesmo com críticos como Cardone levantando bandeiras vermelhas.\n\nA \"XRP Army\" reage e esclarece os fatos\n\nEnquanto isso, membros da comunidade XRP resistiram às alegações de Cardone, chamando-as de exageradas e factualmente incorretas. Robert Doyle, conhecido online como Crypto Sensei, esclareceu que não há confirmação oficial sobre a tecnologia selecionada para o euro digital.\n\nO Banco Central Europeu afirmou que está preparado para lançar uma moeda digital de banco central se aprovado pelo Parlamento Europeu. No entanto, ele não decidiu sobre a tecnologia específica a ser usada.\n\nDoyle também apontou que a Ripple tem se envolvido em discussões sobre CBDC com vários bancos centrais globalmente. Países como Geórgia e Palau já <a href=\"https://thecryptobasic.com/2023/11/03/out-of-9-companies-georgia-selects-ripple-for-its-national-digital-currency/\" rel=\"noopener\" target=\"_blank\">escolheram a tecnologia da Ripple para programas piloto.</a>\n\nAtualmente, não há evidências públicas de que a Ripple ou o XRP Ledger foram selecionados para a iniciativa do euro digital do BCE.\n\nOutro membro proeminente da comunidade, Moon Lambo, respondeu que Cardone é ingênuo, caiu em notícias falsas ou está intencionalmente espalhando desinformação.\n\nEle linkou para o site oficial do BCE, observando que o banco central não tomou nenhuma decisão sobre a plataforma e nem mesmo confirmou se um euro digital será lançado.\n\nMoon Lambo afirmou que Cardone sofre de \"Síndrome de Derangement XRP\", sugerindo que Cardone quer que a história seja verdadeira porque reforça sua narrativa tribal. Ele instou Cardone a agir com integridade, alertando que postagens como a dele erodem a confiança em vez de construir credibilidade.\n\nEnquanto isso, em seus comentários, o advogado Bill Morgan destacou a ironia da afirmação de que o XRP Ledger, uma rede pública e sem permissão, poderia estar cooperando com algumas das pessoas mais opressoras da Terra apenas para sobreviver.\n<p>https://twitter.com/Belisarius2020/status/1932273710335201597</p>",
  "filename": "post_1749561224_xrp-a-covid-das-financas---gary-cardone.json"
}